MikroElektronika/core_packages/PIC/XC8/def/PIC18LF26K80/mcu.h
extern volatile RXF11EIDLbits_t RXF11EIDLbits __at(0xE5F);
// bitfield macros
#define _RXF11EIDL_EID_POSN                                 0x0
#define _RXF11EIDL_EID_POSITION                             0x0
#define _RXF11EIDL_EID_SIZE                                 0x8
#define _RXF11EIDL_EID_LENGTH                               0x8
#define _RXF11EIDL_EID_MASK                                 0xFF
#define _RXF11EIDL_EID0_POSN                                0x0
#define _RXF11EIDL_EID0_POSITION                            0x0
#define _RXF11EIDL_EID0_SIZE                                0x1
#define _RXF11EIDL_EID0_LENGTH                              0x1
#define _RXF11EIDL_EID0_MASK                                0x1
#define _RXF11EIDL_EID1_POSN                                0x1
#define _RXF11EIDL_EID1_POSITION                            0x1
#define _RXF11EIDL_EID1_SIZE                                0x1
#define _RXF11EIDL_EID1_LENGTH                              0x1
#define _RXF11EIDL_EID1_MASK                                0x2
#define _RXF11EIDL_EID2_POSN                                0x2
#define _RXF11EIDL_EID2_POSITION                            0x2
#define _RXF11EIDL_EID2_SIZE                                0x1
#define _RXF11EIDL_EID2_LENGTH                              0x1
#define _RXF11EIDL_EID2_MASK                                0x4
#define _RXF11EIDL_EID3_POSN                                0x3
#define _RXF11EIDL_EID3_POSITION                            0x3
#define _RXF11EIDL_EID3_SIZE                                0x1
#define _RXF11EIDL_EID3_LENGTH                              0x1
#define _RXF11EIDL_EID3_MASK                                0x8
#define _RXF11EIDL_EID4_POSN                                0x4
#define _RXF11EIDL_EID4_POSITION                            0x4
#define _RXF11EIDL_EID4_SIZE                                0x1
#define _RXF11EIDL_EID4_LENGTH                              0x1
#define _RXF11EIDL_EID4_MASK                                0x10
#define _RXF11EIDL_EID5_POSN                                0x5
#define _RXF11EIDL_EID5_POSITION                            0x5
#define _RXF11EIDL_EID5_SIZE                                0x1
#define _RXF11EIDL_EID5_LENGTH                              0x1
#define _RXF11EIDL_EID5_MASK                                0x20
#define _RXF11EIDL_EID6_POSN                                0x6
#define _RXF11EIDL_EID6_POSITION                            0x6
#define _RXF11EIDL_EID6_SIZE                                0x1
#define _RXF11EIDL_EID6_LENGTH                              0x1
#define _RXF11EIDL_EID6_MASK                                0x40
#define _RXF11EIDL_EID7_POSN                                0x7
#define _RXF11EIDL_EID7_POSITION                            0x7
#define _RXF11EIDL_EID7_SIZE                                0x1
#define _RXF11EIDL_EID7_LENGTH                              0x1
#define _RXF11EIDL_EID7_MASK                                0x80
#define _RXF11EIDL_RXF11EID0_POSN                           0x0
#define _RXF11EIDL_RXF11EID0_POSITION                       0x0
#define _RXF11EIDL_RXF11EID0_SIZE                           0x1
#define _RXF11EIDL_RXF11EID0_LENGTH                         0x1
#define _RXF11EIDL_RXF11EID0_MASK                           0x1
#define _RXF11EIDL_RXF11EID1_POSN                           0x1
#define _RXF11EIDL_RXF11EID1_POSITION                       0x1
#define _RXF11EIDL_RXF11EID1_SIZE                           0x1
#define _RXF11EIDL_RXF11EID1_LENGTH                         0x1
#define _RXF11EIDL_RXF11EID1_MASK                           0x2
#define _RXF11EIDL_RXF11EID2_POSN                           0x2
#define _RXF11EIDL_RXF11EID2_POSITION                       0x2
#define _RXF11EIDL_RXF11EID2_SIZE                           0x1
#define _RXF11EIDL_RXF11EID2_LENGTH                         0x1
#define _RXF11EIDL_RXF11EID2_MASK                           0x4
#define _RXF11EIDL_RXF11EID3_POSN                           0x3
#define _RXF11EIDL_RXF11EID3_POSITION                       0x3
#define _RXF11EIDL_RXF11EID3_SIZE                           0x1
#define _RXF11EIDL_RXF11EID3_LENGTH                         0x1
#define _RXF11EIDL_RXF11EID3_MASK                           0x8
#define _RXF11EIDL_RXF11EID4_POSN                           0x4
#define _RXF11EIDL_RXF11EID4_POSITION                       0x4
#define _RXF11EIDL_RXF11EID4_SIZE                           0x1
#define _RXF11EIDL_RXF11EID4_LENGTH                         0x1
#define _RXF11EIDL_RXF11EID4_MASK                           0x10
#define _RXF11EIDL_RXF11EID5_POSN                           0x5
#define _RXF11EIDL_RXF11EID5_POSITION                       0x5
#define _RXF11EIDL_RXF11EID5_SIZE                           0x1
#define _RXF11EIDL_RXF11EID5_LENGTH                         0x1
#define _RXF11EIDL_RXF11EID5_MASK                           0x20
#define _RXF11EIDL_RXF11EID6_POSN                           0x6
#define _RXF11EIDL_RXF11EID6_POSITION                       0x6
#define _RXF11EIDL_RXF11EID6_SIZE                           0x1
#define _RXF11EIDL_RXF11EID6_LENGTH                         0x1
#define _RXF11EIDL_RXF11EID6_MASK                           0x40
#define _RXF11EIDL_RXF11EID7_POSN                           0x7
#define _RXF11EIDL_RXF11EID7_POSITION                       0x7
#define _RXF11EIDL_RXF11EID7_SIZE                           0x1
#define _RXF11EIDL_RXF11EID7_LENGTH                         0x1
#define _RXF11EIDL_RXF11EID7_MASK                           0x80

// Register: RXF12SIDH
#define RXF12SIDH RXF12SIDH
extern volatile unsigned char           RXF12SIDH           __at(0xE60);
#ifndef _LIB_BUILD
asm("RXF12SIDH equ 0E60h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SID                    :8;
    };
    struct {
        unsigned SID3                   :1;
        unsigned SID4                   :1;
        unsigned SID5                   :1;
        unsigned SID6                   :1;
        unsigned SID7                   :1;
        unsigned SID8                   :1;
        unsigned SID9                   :1;
        unsigned SID10                  :1;
    };
    struct {
        unsigned RXF12SID3              :1;
        unsigned RXF12SID4              :1;
        unsigned RXF12SID5              :1;
        unsigned RXF12SID6              :1;
        unsigned RXF12SID7              :1;
        unsigned RXF12SID8              :1;
        unsigned RXF12SID9              :1;
        unsigned RXF12SID10             :1;
    };
} RXF12SIDHbits_t;
