MikroElektronika/core_packages/PIC/XC8/def/PIC18LF26K80/mcu.h
extern volatile B0EIDLbits_t B0EIDLbits __at(0xE84);
// bitfield macros
#define _B0EIDL_EID_POSN                                    0x0
#define _B0EIDL_EID_POSITION                                0x0
#define _B0EIDL_EID_SIZE                                    0x8
#define _B0EIDL_EID_LENGTH                                  0x8
#define _B0EIDL_EID_MASK                                    0xFF
#define _B0EIDL_EID0_POSN                                   0x0
#define _B0EIDL_EID0_POSITION                               0x0
#define _B0EIDL_EID0_SIZE                                   0x1
#define _B0EIDL_EID0_LENGTH                                 0x1
#define _B0EIDL_EID0_MASK                                   0x1
#define _B0EIDL_EID1_POSN                                   0x1
#define _B0EIDL_EID1_POSITION                               0x1
#define _B0EIDL_EID1_SIZE                                   0x1
#define _B0EIDL_EID1_LENGTH                                 0x1
#define _B0EIDL_EID1_MASK                                   0x2
#define _B0EIDL_EID2_POSN                                   0x2
#define _B0EIDL_EID2_POSITION                               0x2
#define _B0EIDL_EID2_SIZE                                   0x1
#define _B0EIDL_EID2_LENGTH                                 0x1
#define _B0EIDL_EID2_MASK                                   0x4
#define _B0EIDL_EID3_POSN                                   0x3
#define _B0EIDL_EID3_POSITION                               0x3
#define _B0EIDL_EID3_SIZE                                   0x1
#define _B0EIDL_EID3_LENGTH                                 0x1
#define _B0EIDL_EID3_MASK                                   0x8
#define _B0EIDL_EID4_POSN                                   0x4
#define _B0EIDL_EID4_POSITION                               0x4
#define _B0EIDL_EID4_SIZE                                   0x1
#define _B0EIDL_EID4_LENGTH                                 0x1
#define _B0EIDL_EID4_MASK                                   0x10
#define _B0EIDL_EID5_POSN                                   0x5
#define _B0EIDL_EID5_POSITION                               0x5
#define _B0EIDL_EID5_SIZE                                   0x1
#define _B0EIDL_EID5_LENGTH                                 0x1
#define _B0EIDL_EID5_MASK                                   0x20
#define _B0EIDL_EID6_POSN                                   0x6
#define _B0EIDL_EID6_POSITION                               0x6
#define _B0EIDL_EID6_SIZE                                   0x1
#define _B0EIDL_EID6_LENGTH                                 0x1
#define _B0EIDL_EID6_MASK                                   0x40
#define _B0EIDL_EID7_POSN                                   0x7
#define _B0EIDL_EID7_POSITION                               0x7
#define _B0EIDL_EID7_SIZE                                   0x1
#define _B0EIDL_EID7_LENGTH                                 0x1
#define _B0EIDL_EID7_MASK                                   0x80
#define _B0EIDL_B0EID0_POSN                                 0x0
#define _B0EIDL_B0EID0_POSITION                             0x0
#define _B0EIDL_B0EID0_SIZE                                 0x1
#define _B0EIDL_B0EID0_LENGTH                               0x1
#define _B0EIDL_B0EID0_MASK                                 0x1
#define _B0EIDL_B0EID1_POSN                                 0x1
#define _B0EIDL_B0EID1_POSITION                             0x1
#define _B0EIDL_B0EID1_SIZE                                 0x1
#define _B0EIDL_B0EID1_LENGTH                               0x1
#define _B0EIDL_B0EID1_MASK                                 0x2
#define _B0EIDL_B0EID2_POSN                                 0x2
#define _B0EIDL_B0EID2_POSITION                             0x2
#define _B0EIDL_B0EID2_SIZE                                 0x1
#define _B0EIDL_B0EID2_LENGTH                               0x1
#define _B0EIDL_B0EID2_MASK                                 0x4
#define _B0EIDL_B0EID3_POSN                                 0x3
#define _B0EIDL_B0EID3_POSITION                             0x3
#define _B0EIDL_B0EID3_SIZE                                 0x1
#define _B0EIDL_B0EID3_LENGTH                               0x1
#define _B0EIDL_B0EID3_MASK                                 0x8
#define _B0EIDL_B0EID4_POSN                                 0x4
#define _B0EIDL_B0EID4_POSITION                             0x4
#define _B0EIDL_B0EID4_SIZE                                 0x1
#define _B0EIDL_B0EID4_LENGTH                               0x1
#define _B0EIDL_B0EID4_MASK                                 0x10
#define _B0EIDL_B0EID5_POSN                                 0x5
#define _B0EIDL_B0EID5_POSITION                             0x5
#define _B0EIDL_B0EID5_SIZE                                 0x1
#define _B0EIDL_B0EID5_LENGTH                               0x1
#define _B0EIDL_B0EID5_MASK                                 0x20
#define _B0EIDL_B0EID6_POSN                                 0x6
#define _B0EIDL_B0EID6_POSITION                             0x6
#define _B0EIDL_B0EID6_SIZE                                 0x1
#define _B0EIDL_B0EID6_LENGTH                               0x1
#define _B0EIDL_B0EID6_MASK                                 0x40
#define _B0EIDL_B0EID7_POSN                                 0x7
#define _B0EIDL_B0EID7_POSITION                             0x7
#define _B0EIDL_B0EID7_SIZE                                 0x1
#define _B0EIDL_B0EID7_LENGTH                               0x1
#define _B0EIDL_B0EID7_MASK                                 0x80

// Register: B0DLC
#define B0DLC B0DLC
extern volatile unsigned char           B0DLC               __at(0xE85);
#ifndef _LIB_BUILD
asm("B0DLC equ 0E85h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DLC                    :4;
        unsigned RB                     :2;
        unsigned RXRTR_TXRTR            :1;
    };
    struct {
        unsigned DLC0                   :1;
        unsigned DLC1                   :1;
        unsigned DLC2                   :1;
        unsigned DLC3                   :1;
        unsigned RB0                    :1;
        unsigned RB1                    :1;
        unsigned RXRTR                  :1;
    };
    struct {
        unsigned                        :6;
        unsigned TXRTR                  :1;
    };
    struct {
        unsigned B0DLC0                 :1;
        unsigned B0DLC1                 :1;
        unsigned B0DLC2                 :1;
        unsigned B0DLC3                 :1;
        unsigned B0RB0                  :1;
        unsigned B0RB1                  :1;
        unsigned B0RXRTR                :1;
    };
} B0DLCbits_t;
extern volatile B0DLCbits_t B0DLCbits __at(0xE85);
// bitfield macros
#define _B0DLC_DLC_POSN                                     0x0
#define _B0DLC_DLC_POSITION                                 0x0
#define _B0DLC_DLC_SIZE                                     0x4
#define _B0DLC_DLC_LENGTH                                   0x4
#define _B0DLC_DLC_MASK                                     0xF
#define _B0DLC_RB_POSN                                      0x4
#define _B0DLC_RB_POSITION                                  0x4
#define _B0DLC_RB_SIZE                                      0x2
#define _B0DLC_RB_LENGTH                                    0x2
#define _B0DLC_RB_MASK                                      0x30
#define _B0DLC_RXRTR_TXRTR_POSN                             0x6
#define _B0DLC_RXRTR_TXRTR_POSITION                         0x6
#define _B0DLC_RXRTR_TXRTR_SIZE                             0x1
#define _B0DLC_RXRTR_TXRTR_LENGTH                           0x1
#define _B0DLC_RXRTR_TXRTR_MASK                             0x40
#define _B0DLC_DLC0_POSN                                    0x0
#define _B0DLC_DLC0_POSITION                                0x0
#define _B0DLC_DLC0_SIZE                                    0x1
#define _B0DLC_DLC0_LENGTH                                  0x1
#define _B0DLC_DLC0_MASK                                    0x1
#define _B0DLC_DLC1_POSN                                    0x1
#define _B0DLC_DLC1_POSITION                                0x1
#define _B0DLC_DLC1_SIZE                                    0x1
#define _B0DLC_DLC1_LENGTH                                  0x1
#define _B0DLC_DLC1_MASK                                    0x2
#define _B0DLC_DLC2_POSN                                    0x2
#define _B0DLC_DLC2_POSITION                                0x2
#define _B0DLC_DLC2_SIZE                                    0x1
#define _B0DLC_DLC2_LENGTH                                  0x1
#define _B0DLC_DLC2_MASK                                    0x4
#define _B0DLC_DLC3_POSN                                    0x3
#define _B0DLC_DLC3_POSITION                                0x3
#define _B0DLC_DLC3_SIZE                                    0x1
#define _B0DLC_DLC3_LENGTH                                  0x1
#define _B0DLC_DLC3_MASK                                    0x8
#define _B0DLC_RB0_POSN                                     0x4
#define _B0DLC_RB0_POSITION                                 0x4
#define _B0DLC_RB0_SIZE                                     0x1
#define _B0DLC_RB0_LENGTH                                   0x1
#define _B0DLC_RB0_MASK                                     0x10
#define _B0DLC_RB1_POSN                                     0x5
#define _B0DLC_RB1_POSITION                                 0x5
#define _B0DLC_RB1_SIZE                                     0x1
#define _B0DLC_RB1_LENGTH                                   0x1
#define _B0DLC_RB1_MASK                                     0x20
#define _B0DLC_RXRTR_POSN                                   0x6
#define _B0DLC_RXRTR_POSITION                               0x6
#define _B0DLC_RXRTR_SIZE                                   0x1
#define _B0DLC_RXRTR_LENGTH                                 0x1
#define _B0DLC_RXRTR_MASK                                   0x40
#define _B0DLC_TXRTR_POSN                                   0x6
#define _B0DLC_TXRTR_POSITION                               0x6
#define _B0DLC_TXRTR_SIZE                                   0x1
#define _B0DLC_TXRTR_LENGTH                                 0x1
#define _B0DLC_TXRTR_MASK                                   0x40
#define _B0DLC_B0DLC0_POSN                                  0x0
#define _B0DLC_B0DLC0_POSITION                              0x0
#define _B0DLC_B0DLC0_SIZE                                  0x1
#define _B0DLC_B0DLC0_LENGTH                                0x1
#define _B0DLC_B0DLC0_MASK                                  0x1
#define _B0DLC_B0DLC1_POSN                                  0x1
#define _B0DLC_B0DLC1_POSITION                              0x1
#define _B0DLC_B0DLC1_SIZE                                  0x1
#define _B0DLC_B0DLC1_LENGTH                                0x1
#define _B0DLC_B0DLC1_MASK                                  0x2
#define _B0DLC_B0DLC2_POSN                                  0x2
#define _B0DLC_B0DLC2_POSITION                              0x2
#define _B0DLC_B0DLC2_SIZE                                  0x1
#define _B0DLC_B0DLC2_LENGTH                                0x1
#define _B0DLC_B0DLC2_MASK                                  0x4
#define _B0DLC_B0DLC3_POSN                                  0x3
#define _B0DLC_B0DLC3_POSITION                              0x3
#define _B0DLC_B0DLC3_SIZE                                  0x1
#define _B0DLC_B0DLC3_LENGTH                                0x1
#define _B0DLC_B0DLC3_MASK                                  0x8
#define _B0DLC_B0RB0_POSN                                   0x4
#define _B0DLC_B0RB0_POSITION                               0x4
#define _B0DLC_B0RB0_SIZE                                   0x1
#define _B0DLC_B0RB0_LENGTH                                 0x1
#define _B0DLC_B0RB0_MASK                                   0x10
#define _B0DLC_B0RB1_POSN                                   0x5
#define _B0DLC_B0RB1_POSITION                               0x5
#define _B0DLC_B0RB1_SIZE                                   0x1
#define _B0DLC_B0RB1_LENGTH                                 0x1
#define _B0DLC_B0RB1_MASK                                   0x20
#define _B0DLC_B0RXRTR_POSN                                 0x6
#define _B0DLC_B0RXRTR_POSITION                             0x6
#define _B0DLC_B0RXRTR_SIZE                                 0x1
#define _B0DLC_B0RXRTR_LENGTH                               0x1
#define _B0DLC_B0RXRTR_MASK                                 0x40

// Register: B0D0
#define B0D0 B0D0
extern volatile unsigned char           B0D0                __at(0xE86);
#ifndef _LIB_BUILD
asm("B0D0 equ 0E86h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned B0D0                   :8;
    };
    struct {
        unsigned B0D00                  :1;
        unsigned B0D01                  :1;
        unsigned B0D02                  :1;
        unsigned B0D03                  :1;
        unsigned B0D04                  :1;
        unsigned B0D05                  :1;
        unsigned B0D06                  :1;
        unsigned B0D07                  :1;
    };
} B0D0bits_t;
extern volatile B0D0bits_t B0D0bits __at(0xE86);
// bitfield macros
#define _B0D0_B0D0_POSN                                     0x0
#define _B0D0_B0D0_POSITION                                 0x0
#define _B0D0_B0D0_SIZE                                     0x8
#define _B0D0_B0D0_LENGTH                                   0x8
#define _B0D0_B0D0_MASK                                     0xFF
#define _B0D0_B0D00_POSN                                    0x0
#define _B0D0_B0D00_POSITION                                0x0
#define _B0D0_B0D00_SIZE                                    0x1
#define _B0D0_B0D00_LENGTH                                  0x1
#define _B0D0_B0D00_MASK                                    0x1
#define _B0D0_B0D01_POSN                                    0x1
#define _B0D0_B0D01_POSITION                                0x1
#define _B0D0_B0D01_SIZE                                    0x1
#define _B0D0_B0D01_LENGTH                                  0x1
#define _B0D0_B0D01_MASK                                    0x2
#define _B0D0_B0D02_POSN                                    0x2
#define _B0D0_B0D02_POSITION                                0x2
#define _B0D0_B0D02_SIZE                                    0x1
#define _B0D0_B0D02_LENGTH                                  0x1
#define _B0D0_B0D02_MASK                                    0x4
#define _B0D0_B0D03_POSN                                    0x3
#define _B0D0_B0D03_POSITION                                0x3
#define _B0D0_B0D03_SIZE                                    0x1
#define _B0D0_B0D03_LENGTH                                  0x1
#define _B0D0_B0D03_MASK                                    0x8
#define _B0D0_B0D04_POSN                                    0x4
#define _B0D0_B0D04_POSITION                                0x4
#define _B0D0_B0D04_SIZE                                    0x1
#define _B0D0_B0D04_LENGTH                                  0x1
#define _B0D0_B0D04_MASK                                    0x10
#define _B0D0_B0D05_POSN                                    0x5
#define _B0D0_B0D05_POSITION                                0x5
#define _B0D0_B0D05_SIZE                                    0x1
#define _B0D0_B0D05_LENGTH                                  0x1
#define _B0D0_B0D05_MASK                                    0x20
#define _B0D0_B0D06_POSN                                    0x6
#define _B0D0_B0D06_POSITION                                0x6
#define _B0D0_B0D06_SIZE                                    0x1
#define _B0D0_B0D06_LENGTH                                  0x1
#define _B0D0_B0D06_MASK                                    0x40
#define _B0D0_B0D07_POSN                                    0x7
#define _B0D0_B0D07_POSITION                                0x7
#define _B0D0_B0D07_SIZE                                    0x1
#define _B0D0_B0D07_LENGTH                                  0x1
#define _B0D0_B0D07_MASK                                    0x80

// Register: B0D1
#define B0D1 B0D1
extern volatile unsigned char           B0D1                __at(0xE87);
#ifndef _LIB_BUILD
asm("B0D1 equ 0E87h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned B0D1                   :8;
    };
    struct {
        unsigned B0D10                  :1;
        unsigned B0D11                  :1;
        unsigned B0D12                  :1;
        unsigned B0D13                  :1;
        unsigned B0D14                  :1;
        unsigned B0D15                  :1;
        unsigned B0D16                  :1;
        unsigned B0D17                  :1;
    };
} B0D1bits_t;
extern volatile B0D1bits_t B0D1bits __at(0xE87);
// bitfield macros
#define _B0D1_B0D1_POSN                                     0x0
#define _B0D1_B0D1_POSITION                                 0x0
#define _B0D1_B0D1_SIZE                                     0x8
#define _B0D1_B0D1_LENGTH                                   0x8
#define _B0D1_B0D1_MASK                                     0xFF
#define _B0D1_B0D10_POSN                                    0x0
#define _B0D1_B0D10_POSITION                                0x0
#define _B0D1_B0D10_SIZE                                    0x1
#define _B0D1_B0D10_LENGTH                                  0x1
#define _B0D1_B0D10_MASK                                    0x1
#define _B0D1_B0D11_POSN                                    0x1
#define _B0D1_B0D11_POSITION                                0x1
#define _B0D1_B0D11_SIZE                                    0x1
#define _B0D1_B0D11_LENGTH                                  0x1
#define _B0D1_B0D11_MASK                                    0x2
#define _B0D1_B0D12_POSN                                    0x2
#define _B0D1_B0D12_POSITION                                0x2
#define _B0D1_B0D12_SIZE                                    0x1
#define _B0D1_B0D12_LENGTH                                  0x1
#define _B0D1_B0D12_MASK                                    0x4
#define _B0D1_B0D13_POSN                                    0x3
#define _B0D1_B0D13_POSITION                                0x3
#define _B0D1_B0D13_SIZE                                    0x1
#define _B0D1_B0D13_LENGTH                                  0x1
#define _B0D1_B0D13_MASK                                    0x8
#define _B0D1_B0D14_POSN                                    0x4
#define _B0D1_B0D14_POSITION                                0x4
#define _B0D1_B0D14_SIZE                                    0x1
#define _B0D1_B0D14_LENGTH                                  0x1
#define _B0D1_B0D14_MASK                                    0x10
#define _B0D1_B0D15_POSN                                    0x5
#define _B0D1_B0D15_POSITION                                0x5
#define _B0D1_B0D15_SIZE                                    0x1
#define _B0D1_B0D15_LENGTH                                  0x1
#define _B0D1_B0D15_MASK                                    0x20
#define _B0D1_B0D16_POSN                                    0x6
#define _B0D1_B0D16_POSITION                                0x6
#define _B0D1_B0D16_SIZE                                    0x1
#define _B0D1_B0D16_LENGTH                                  0x1
#define _B0D1_B0D16_MASK                                    0x40
#define _B0D1_B0D17_POSN                                    0x7
#define _B0D1_B0D17_POSITION                                0x7
#define _B0D1_B0D17_SIZE                                    0x1
#define _B0D1_B0D17_LENGTH                                  0x1
#define _B0D1_B0D17_MASK                                    0x80

// Register: B0D2
#define B0D2 B0D2
extern volatile unsigned char           B0D2                __at(0xE88);
#ifndef _LIB_BUILD
asm("B0D2 equ 0E88h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned B0D2                   :8;
    };
    struct {
        unsigned B0D20                  :1;
        unsigned B0D21                  :1;
        unsigned B0D22                  :1;
        unsigned B0D23                  :1;
        unsigned B0D24                  :1;
        unsigned B0D25                  :1;
        unsigned B0D26                  :1;
        unsigned B0D27                  :1;
    };
} B0D2bits_t;
