MikroElektronika/core_packages/PIC/XC8/def/PIC18LF26K80/mcu.h
extern volatile B2EIDLbits_t B2EIDLbits __at(0xEA4);
// bitfield macros
#define _B2EIDL_EID_POSN                                    0x0
#define _B2EIDL_EID_POSITION                                0x0
#define _B2EIDL_EID_SIZE                                    0x8
#define _B2EIDL_EID_LENGTH                                  0x8
#define _B2EIDL_EID_MASK                                    0xFF
#define _B2EIDL_EID0_POSN                                   0x0
#define _B2EIDL_EID0_POSITION                               0x0
#define _B2EIDL_EID0_SIZE                                   0x1
#define _B2EIDL_EID0_LENGTH                                 0x1
#define _B2EIDL_EID0_MASK                                   0x1
#define _B2EIDL_EID1_POSN                                   0x1
#define _B2EIDL_EID1_POSITION                               0x1
#define _B2EIDL_EID1_SIZE                                   0x1
#define _B2EIDL_EID1_LENGTH                                 0x1
#define _B2EIDL_EID1_MASK                                   0x2
#define _B2EIDL_EID2_POSN                                   0x2
#define _B2EIDL_EID2_POSITION                               0x2
#define _B2EIDL_EID2_SIZE                                   0x1
#define _B2EIDL_EID2_LENGTH                                 0x1
#define _B2EIDL_EID2_MASK                                   0x4
#define _B2EIDL_EID3_POSN                                   0x3
#define _B2EIDL_EID3_POSITION                               0x3
#define _B2EIDL_EID3_SIZE                                   0x1
#define _B2EIDL_EID3_LENGTH                                 0x1
#define _B2EIDL_EID3_MASK                                   0x8
#define _B2EIDL_EID4_POSN                                   0x4
#define _B2EIDL_EID4_POSITION                               0x4
#define _B2EIDL_EID4_SIZE                                   0x1
#define _B2EIDL_EID4_LENGTH                                 0x1
#define _B2EIDL_EID4_MASK                                   0x10
#define _B2EIDL_EID5_POSN                                   0x5
#define _B2EIDL_EID5_POSITION                               0x5
#define _B2EIDL_EID5_SIZE                                   0x1
#define _B2EIDL_EID5_LENGTH                                 0x1
#define _B2EIDL_EID5_MASK                                   0x20
#define _B2EIDL_EID6_POSN                                   0x6
#define _B2EIDL_EID6_POSITION                               0x6
#define _B2EIDL_EID6_SIZE                                   0x1
#define _B2EIDL_EID6_LENGTH                                 0x1
#define _B2EIDL_EID6_MASK                                   0x40
#define _B2EIDL_EID7_POSN                                   0x7
#define _B2EIDL_EID7_POSITION                               0x7
#define _B2EIDL_EID7_SIZE                                   0x1
#define _B2EIDL_EID7_LENGTH                                 0x1
#define _B2EIDL_EID7_MASK                                   0x80
#define _B2EIDL_B2EID0_POSN                                 0x0
#define _B2EIDL_B2EID0_POSITION                             0x0
#define _B2EIDL_B2EID0_SIZE                                 0x1
#define _B2EIDL_B2EID0_LENGTH                               0x1
#define _B2EIDL_B2EID0_MASK                                 0x1
#define _B2EIDL_B2EID1_POSN                                 0x1
#define _B2EIDL_B2EID1_POSITION                             0x1
#define _B2EIDL_B2EID1_SIZE                                 0x1
#define _B2EIDL_B2EID1_LENGTH                               0x1
#define _B2EIDL_B2EID1_MASK                                 0x2
#define _B2EIDL_B2EID2_POSN                                 0x2
#define _B2EIDL_B2EID2_POSITION                             0x2
#define _B2EIDL_B2EID2_SIZE                                 0x1
#define _B2EIDL_B2EID2_LENGTH                               0x1
#define _B2EIDL_B2EID2_MASK                                 0x4
#define _B2EIDL_B2EID3_POSN                                 0x3
#define _B2EIDL_B2EID3_POSITION                             0x3
#define _B2EIDL_B2EID3_SIZE                                 0x1
#define _B2EIDL_B2EID3_LENGTH                               0x1
#define _B2EIDL_B2EID3_MASK                                 0x8
#define _B2EIDL_B2EID4_POSN                                 0x4
#define _B2EIDL_B2EID4_POSITION                             0x4
#define _B2EIDL_B2EID4_SIZE                                 0x1
#define _B2EIDL_B2EID4_LENGTH                               0x1
#define _B2EIDL_B2EID4_MASK                                 0x10
#define _B2EIDL_B2EID5_POSN                                 0x5
#define _B2EIDL_B2EID5_POSITION                             0x5
#define _B2EIDL_B2EID5_SIZE                                 0x1
#define _B2EIDL_B2EID5_LENGTH                               0x1
#define _B2EIDL_B2EID5_MASK                                 0x20
#define _B2EIDL_B2EID6_POSN                                 0x6
#define _B2EIDL_B2EID6_POSITION                             0x6
#define _B2EIDL_B2EID6_SIZE                                 0x1
#define _B2EIDL_B2EID6_LENGTH                               0x1
#define _B2EIDL_B2EID6_MASK                                 0x40
#define _B2EIDL_B2EID7_POSN                                 0x7
#define _B2EIDL_B2EID7_POSITION                             0x7
#define _B2EIDL_B2EID7_SIZE                                 0x1
#define _B2EIDL_B2EID7_LENGTH                               0x1
#define _B2EIDL_B2EID7_MASK                                 0x80

// Register: B2DLC
#define B2DLC B2DLC
extern volatile unsigned char           B2DLC               __at(0xEA5);
#ifndef _LIB_BUILD
asm("B2DLC equ 0EA5h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DLC                    :4;
        unsigned RB                     :2;
        unsigned RXRTR_TXRTR            :1;
    };
    struct {
        unsigned DLC0                   :1;
        unsigned DLC1                   :1;
        unsigned DLC2                   :1;
        unsigned DLC3                   :1;
        unsigned RB0                    :1;
        unsigned RB1                    :1;
        unsigned RXRTR                  :1;
    };
    struct {
        unsigned                        :6;
        unsigned TXRTR                  :1;
    };
    struct {
        unsigned B2DLC0                 :1;
        unsigned B2DLC1                 :1;
        unsigned B2DLC2                 :1;
        unsigned B2DLC3                 :1;
        unsigned B2RB0                  :1;
        unsigned B2RB1                  :1;
        unsigned B2RXRTR                :1;
    };
} B2DLCbits_t;
extern volatile B2DLCbits_t B2DLCbits __at(0xEA5);
// bitfield macros
#define _B2DLC_DLC_POSN                                     0x0
#define _B2DLC_DLC_POSITION                                 0x0
#define _B2DLC_DLC_SIZE                                     0x4
#define _B2DLC_DLC_LENGTH                                   0x4
#define _B2DLC_DLC_MASK                                     0xF
#define _B2DLC_RB_POSN                                      0x4
#define _B2DLC_RB_POSITION                                  0x4
#define _B2DLC_RB_SIZE                                      0x2
#define _B2DLC_RB_LENGTH                                    0x2
#define _B2DLC_RB_MASK                                      0x30
#define _B2DLC_RXRTR_TXRTR_POSN                             0x6
#define _B2DLC_RXRTR_TXRTR_POSITION                         0x6
#define _B2DLC_RXRTR_TXRTR_SIZE                             0x1
#define _B2DLC_RXRTR_TXRTR_LENGTH                           0x1
#define _B2DLC_RXRTR_TXRTR_MASK                             0x40
#define _B2DLC_DLC0_POSN                                    0x0
#define _B2DLC_DLC0_POSITION                                0x0
#define _B2DLC_DLC0_SIZE                                    0x1
#define _B2DLC_DLC0_LENGTH                                  0x1
#define _B2DLC_DLC0_MASK                                    0x1
#define _B2DLC_DLC1_POSN                                    0x1
#define _B2DLC_DLC1_POSITION                                0x1
#define _B2DLC_DLC1_SIZE                                    0x1
#define _B2DLC_DLC1_LENGTH                                  0x1
#define _B2DLC_DLC1_MASK                                    0x2
#define _B2DLC_DLC2_POSN                                    0x2
#define _B2DLC_DLC2_POSITION                                0x2
#define _B2DLC_DLC2_SIZE                                    0x1
#define _B2DLC_DLC2_LENGTH                                  0x1
#define _B2DLC_DLC2_MASK                                    0x4
#define _B2DLC_DLC3_POSN                                    0x3
#define _B2DLC_DLC3_POSITION                                0x3
#define _B2DLC_DLC3_SIZE                                    0x1
#define _B2DLC_DLC3_LENGTH                                  0x1
#define _B2DLC_DLC3_MASK                                    0x8
#define _B2DLC_RB0_POSN                                     0x4
#define _B2DLC_RB0_POSITION                                 0x4
#define _B2DLC_RB0_SIZE                                     0x1
#define _B2DLC_RB0_LENGTH                                   0x1
#define _B2DLC_RB0_MASK                                     0x10
#define _B2DLC_RB1_POSN                                     0x5
#define _B2DLC_RB1_POSITION                                 0x5
#define _B2DLC_RB1_SIZE                                     0x1
#define _B2DLC_RB1_LENGTH                                   0x1
#define _B2DLC_RB1_MASK                                     0x20
#define _B2DLC_RXRTR_POSN                                   0x6
#define _B2DLC_RXRTR_POSITION                               0x6
#define _B2DLC_RXRTR_SIZE                                   0x1
#define _B2DLC_RXRTR_LENGTH                                 0x1
#define _B2DLC_RXRTR_MASK                                   0x40
#define _B2DLC_TXRTR_POSN                                   0x6
#define _B2DLC_TXRTR_POSITION                               0x6
#define _B2DLC_TXRTR_SIZE                                   0x1
#define _B2DLC_TXRTR_LENGTH                                 0x1
#define _B2DLC_TXRTR_MASK                                   0x40
#define _B2DLC_B2DLC0_POSN                                  0x0
#define _B2DLC_B2DLC0_POSITION                              0x0
#define _B2DLC_B2DLC0_SIZE                                  0x1
#define _B2DLC_B2DLC0_LENGTH                                0x1
#define _B2DLC_B2DLC0_MASK                                  0x1
#define _B2DLC_B2DLC1_POSN                                  0x1
#define _B2DLC_B2DLC1_POSITION                              0x1
#define _B2DLC_B2DLC1_SIZE                                  0x1
#define _B2DLC_B2DLC1_LENGTH                                0x1
#define _B2DLC_B2DLC1_MASK                                  0x2
#define _B2DLC_B2DLC2_POSN                                  0x2
#define _B2DLC_B2DLC2_POSITION                              0x2
#define _B2DLC_B2DLC2_SIZE                                  0x1
#define _B2DLC_B2DLC2_LENGTH                                0x1
#define _B2DLC_B2DLC2_MASK                                  0x4
#define _B2DLC_B2DLC3_POSN                                  0x3
#define _B2DLC_B2DLC3_POSITION                              0x3
#define _B2DLC_B2DLC3_SIZE                                  0x1
#define _B2DLC_B2DLC3_LENGTH                                0x1
#define _B2DLC_B2DLC3_MASK                                  0x8
#define _B2DLC_B2RB0_POSN                                   0x4
#define _B2DLC_B2RB0_POSITION                               0x4
#define _B2DLC_B2RB0_SIZE                                   0x1
#define _B2DLC_B2RB0_LENGTH                                 0x1
#define _B2DLC_B2RB0_MASK                                   0x10
#define _B2DLC_B2RB1_POSN                                   0x5
#define _B2DLC_B2RB1_POSITION                               0x5
#define _B2DLC_B2RB1_SIZE                                   0x1
#define _B2DLC_B2RB1_LENGTH                                 0x1
#define _B2DLC_B2RB1_MASK                                   0x20
#define _B2DLC_B2RXRTR_POSN                                 0x6
#define _B2DLC_B2RXRTR_POSITION                             0x6
#define _B2DLC_B2RXRTR_SIZE                                 0x1
#define _B2DLC_B2RXRTR_LENGTH                               0x1
#define _B2DLC_B2RXRTR_MASK                                 0x40

// Register: B2D0
#define B2D0 B2D0
extern volatile unsigned char           B2D0                __at(0xEA6);
#ifndef _LIB_BUILD
asm("B2D0 equ 0EA6h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned B2D0                   :8;
    };
    struct {
        unsigned B2D00                  :1;
        unsigned B2D01                  :1;
        unsigned B2D02                  :1;
        unsigned B2D03                  :1;
        unsigned B2D04                  :1;
        unsigned B2D05                  :1;
        unsigned B2D06                  :1;
        unsigned B2D07                  :1;
    };
} B2D0bits_t;
extern volatile B2D0bits_t B2D0bits __at(0xEA6);
// bitfield macros
#define _B2D0_B2D0_POSN                                     0x0
#define _B2D0_B2D0_POSITION                                 0x0
#define _B2D0_B2D0_SIZE                                     0x8
#define _B2D0_B2D0_LENGTH                                   0x8
#define _B2D0_B2D0_MASK                                     0xFF
#define _B2D0_B2D00_POSN                                    0x0
#define _B2D0_B2D00_POSITION                                0x0
#define _B2D0_B2D00_SIZE                                    0x1
#define _B2D0_B2D00_LENGTH                                  0x1
#define _B2D0_B2D00_MASK                                    0x1
#define _B2D0_B2D01_POSN                                    0x1
#define _B2D0_B2D01_POSITION                                0x1
#define _B2D0_B2D01_SIZE                                    0x1
#define _B2D0_B2D01_LENGTH                                  0x1
#define _B2D0_B2D01_MASK                                    0x2
#define _B2D0_B2D02_POSN                                    0x2
#define _B2D0_B2D02_POSITION                                0x2
#define _B2D0_B2D02_SIZE                                    0x1
#define _B2D0_B2D02_LENGTH                                  0x1
#define _B2D0_B2D02_MASK                                    0x4
#define _B2D0_B2D03_POSN                                    0x3
#define _B2D0_B2D03_POSITION                                0x3
#define _B2D0_B2D03_SIZE                                    0x1
#define _B2D0_B2D03_LENGTH                                  0x1
#define _B2D0_B2D03_MASK                                    0x8
#define _B2D0_B2D04_POSN                                    0x4
#define _B2D0_B2D04_POSITION                                0x4
#define _B2D0_B2D04_SIZE                                    0x1
#define _B2D0_B2D04_LENGTH                                  0x1
#define _B2D0_B2D04_MASK                                    0x10
#define _B2D0_B2D05_POSN                                    0x5
#define _B2D0_B2D05_POSITION                                0x5
#define _B2D0_B2D05_SIZE                                    0x1
#define _B2D0_B2D05_LENGTH                                  0x1
#define _B2D0_B2D05_MASK                                    0x20
#define _B2D0_B2D06_POSN                                    0x6
#define _B2D0_B2D06_POSITION                                0x6
#define _B2D0_B2D06_SIZE                                    0x1
#define _B2D0_B2D06_LENGTH                                  0x1
#define _B2D0_B2D06_MASK                                    0x40
#define _B2D0_B2D07_POSN                                    0x7
#define _B2D0_B2D07_POSITION                                0x7
#define _B2D0_B2D07_SIZE                                    0x1
#define _B2D0_B2D07_LENGTH                                  0x1
#define _B2D0_B2D07_MASK                                    0x80

// Register: B2D1
#define B2D1 B2D1
extern volatile unsigned char           B2D1                __at(0xEA7);
#ifndef _LIB_BUILD
asm("B2D1 equ 0EA7h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned B2D1                   :8;
    };
    struct {
        unsigned B2D10                  :1;
        unsigned B2D11                  :1;
        unsigned B2D12                  :1;
        unsigned B2D13                  :1;
        unsigned B2D14                  :1;
        unsigned B2D15                  :1;
        unsigned B2D16                  :1;
        unsigned B2D17                  :1;
    };
} B2D1bits_t;
extern volatile B2D1bits_t B2D1bits __at(0xEA7);
// bitfield macros
#define _B2D1_B2D1_POSN                                     0x0
#define _B2D1_B2D1_POSITION                                 0x0
#define _B2D1_B2D1_SIZE                                     0x8
#define _B2D1_B2D1_LENGTH                                   0x8
#define _B2D1_B2D1_MASK                                     0xFF
#define _B2D1_B2D10_POSN                                    0x0
#define _B2D1_B2D10_POSITION                                0x0
#define _B2D1_B2D10_SIZE                                    0x1
#define _B2D1_B2D10_LENGTH                                  0x1
#define _B2D1_B2D10_MASK                                    0x1
#define _B2D1_B2D11_POSN                                    0x1
#define _B2D1_B2D11_POSITION                                0x1
#define _B2D1_B2D11_SIZE                                    0x1
#define _B2D1_B2D11_LENGTH                                  0x1
#define _B2D1_B2D11_MASK                                    0x2
#define _B2D1_B2D12_POSN                                    0x2
#define _B2D1_B2D12_POSITION                                0x2
#define _B2D1_B2D12_SIZE                                    0x1
#define _B2D1_B2D12_LENGTH                                  0x1
#define _B2D1_B2D12_MASK                                    0x4
#define _B2D1_B2D13_POSN                                    0x3
#define _B2D1_B2D13_POSITION                                0x3
#define _B2D1_B2D13_SIZE                                    0x1
#define _B2D1_B2D13_LENGTH                                  0x1
#define _B2D1_B2D13_MASK                                    0x8
#define _B2D1_B2D14_POSN                                    0x4
#define _B2D1_B2D14_POSITION                                0x4
#define _B2D1_B2D14_SIZE                                    0x1
#define _B2D1_B2D14_LENGTH                                  0x1
#define _B2D1_B2D14_MASK                                    0x10
#define _B2D1_B2D15_POSN                                    0x5
#define _B2D1_B2D15_POSITION                                0x5
#define _B2D1_B2D15_SIZE                                    0x1
#define _B2D1_B2D15_LENGTH                                  0x1
#define _B2D1_B2D15_MASK                                    0x20
#define _B2D1_B2D16_POSN                                    0x6
#define _B2D1_B2D16_POSITION                                0x6
#define _B2D1_B2D16_SIZE                                    0x1
#define _B2D1_B2D16_LENGTH                                  0x1
#define _B2D1_B2D16_MASK                                    0x40
#define _B2D1_B2D17_POSN                                    0x7
#define _B2D1_B2D17_POSITION                                0x7
#define _B2D1_B2D17_SIZE                                    0x1
#define _B2D1_B2D17_LENGTH                                  0x1
#define _B2D1_B2D17_MASK                                    0x80

// Register: B2D2
#define B2D2 B2D2
extern volatile unsigned char           B2D2                __at(0xEA8);
#ifndef _LIB_BUILD
asm("B2D2 equ 0EA8h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned B2D2                   :8;
    };
    struct {
        unsigned B2D20                  :1;
        unsigned B2D21                  :1;
        unsigned B2D22                  :1;
        unsigned B2D23                  :1;
        unsigned B2D24                  :1;
        unsigned B2D25                  :1;
        unsigned B2D26                  :1;
        unsigned B2D27                  :1;
    };
} B2D2bits_t;
