MikroElektronika/core_packages/PIC/XC8/def/PIC18LF26K80/mcu.h
extern volatile B3EIDLbits_t B3EIDLbits __at(0xEB4);
// bitfield macros
#define _B3EIDL_EID_POSN                                    0x0
#define _B3EIDL_EID_POSITION                                0x0
#define _B3EIDL_EID_SIZE                                    0x8
#define _B3EIDL_EID_LENGTH                                  0x8
#define _B3EIDL_EID_MASK                                    0xFF
#define _B3EIDL_EID0_POSN                                   0x0
#define _B3EIDL_EID0_POSITION                               0x0
#define _B3EIDL_EID0_SIZE                                   0x1
#define _B3EIDL_EID0_LENGTH                                 0x1
#define _B3EIDL_EID0_MASK                                   0x1
#define _B3EIDL_EID1_POSN                                   0x1
#define _B3EIDL_EID1_POSITION                               0x1
#define _B3EIDL_EID1_SIZE                                   0x1
#define _B3EIDL_EID1_LENGTH                                 0x1
#define _B3EIDL_EID1_MASK                                   0x2
#define _B3EIDL_EID2_POSN                                   0x2
#define _B3EIDL_EID2_POSITION                               0x2
#define _B3EIDL_EID2_SIZE                                   0x1
#define _B3EIDL_EID2_LENGTH                                 0x1
#define _B3EIDL_EID2_MASK                                   0x4
#define _B3EIDL_EID3_POSN                                   0x3
#define _B3EIDL_EID3_POSITION                               0x3
#define _B3EIDL_EID3_SIZE                                   0x1
#define _B3EIDL_EID3_LENGTH                                 0x1
#define _B3EIDL_EID3_MASK                                   0x8
#define _B3EIDL_EID4_POSN                                   0x4
#define _B3EIDL_EID4_POSITION                               0x4
#define _B3EIDL_EID4_SIZE                                   0x1
#define _B3EIDL_EID4_LENGTH                                 0x1
#define _B3EIDL_EID4_MASK                                   0x10
#define _B3EIDL_EID5_POSN                                   0x5
#define _B3EIDL_EID5_POSITION                               0x5
#define _B3EIDL_EID5_SIZE                                   0x1
#define _B3EIDL_EID5_LENGTH                                 0x1
#define _B3EIDL_EID5_MASK                                   0x20
#define _B3EIDL_EID6_POSN                                   0x6
#define _B3EIDL_EID6_POSITION                               0x6
#define _B3EIDL_EID6_SIZE                                   0x1
#define _B3EIDL_EID6_LENGTH                                 0x1
#define _B3EIDL_EID6_MASK                                   0x40
#define _B3EIDL_EID7_POSN                                   0x7
#define _B3EIDL_EID7_POSITION                               0x7
#define _B3EIDL_EID7_SIZE                                   0x1
#define _B3EIDL_EID7_LENGTH                                 0x1
#define _B3EIDL_EID7_MASK                                   0x80
#define _B3EIDL_B3EID0_POSN                                 0x0
#define _B3EIDL_B3EID0_POSITION                             0x0
#define _B3EIDL_B3EID0_SIZE                                 0x1
#define _B3EIDL_B3EID0_LENGTH                               0x1
#define _B3EIDL_B3EID0_MASK                                 0x1
#define _B3EIDL_B3EID1_POSN                                 0x1
#define _B3EIDL_B3EID1_POSITION                             0x1
#define _B3EIDL_B3EID1_SIZE                                 0x1
#define _B3EIDL_B3EID1_LENGTH                               0x1
#define _B3EIDL_B3EID1_MASK                                 0x2
#define _B3EIDL_B3EID2_POSN                                 0x2
#define _B3EIDL_B3EID2_POSITION                             0x2
#define _B3EIDL_B3EID2_SIZE                                 0x1
#define _B3EIDL_B3EID2_LENGTH                               0x1
#define _B3EIDL_B3EID2_MASK                                 0x4
#define _B3EIDL_B3EID3_POSN                                 0x3
#define _B3EIDL_B3EID3_POSITION                             0x3
#define _B3EIDL_B3EID3_SIZE                                 0x1
#define _B3EIDL_B3EID3_LENGTH                               0x1
#define _B3EIDL_B3EID3_MASK                                 0x8
#define _B3EIDL_B3EID4_POSN                                 0x4
#define _B3EIDL_B3EID4_POSITION                             0x4
#define _B3EIDL_B3EID4_SIZE                                 0x1
#define _B3EIDL_B3EID4_LENGTH                               0x1
#define _B3EIDL_B3EID4_MASK                                 0x10
#define _B3EIDL_B3EID5_POSN                                 0x5
#define _B3EIDL_B3EID5_POSITION                             0x5
#define _B3EIDL_B3EID5_SIZE                                 0x1
#define _B3EIDL_B3EID5_LENGTH                               0x1
#define _B3EIDL_B3EID5_MASK                                 0x20
#define _B3EIDL_B3EID6_POSN                                 0x6
#define _B3EIDL_B3EID6_POSITION                             0x6
#define _B3EIDL_B3EID6_SIZE                                 0x1
#define _B3EIDL_B3EID6_LENGTH                               0x1
#define _B3EIDL_B3EID6_MASK                                 0x40
#define _B3EIDL_B3EID7_POSN                                 0x7
#define _B3EIDL_B3EID7_POSITION                             0x7
#define _B3EIDL_B3EID7_SIZE                                 0x1
#define _B3EIDL_B3EID7_LENGTH                               0x1
#define _B3EIDL_B3EID7_MASK                                 0x80

// Register: B3DLC
#define B3DLC B3DLC
extern volatile unsigned char           B3DLC               __at(0xEB5);
#ifndef _LIB_BUILD
asm("B3DLC equ 0EB5h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DLC                    :4;
        unsigned RB                     :2;
        unsigned RXRTR_TXRTR            :1;
    };
    struct {
        unsigned DLC0                   :1;
        unsigned DLC1                   :1;
        unsigned DLC2                   :1;
        unsigned DLC3                   :1;
        unsigned RB0                    :1;
        unsigned RB1                    :1;
        unsigned RXRTR                  :1;
    };
    struct {
        unsigned                        :6;
        unsigned TXRTR                  :1;
    };
    struct {
        unsigned B3DLC0                 :1;
        unsigned B3DLC1                 :1;
        unsigned B3DLC2                 :1;
        unsigned B3DLC3                 :1;
        unsigned B3RB0                  :1;
        unsigned B3RB1                  :1;
        unsigned B3RXRTR                :1;
    };
} B3DLCbits_t;
extern volatile B3DLCbits_t B3DLCbits __at(0xEB5);
// bitfield macros
#define _B3DLC_DLC_POSN                                     0x0
#define _B3DLC_DLC_POSITION                                 0x0
#define _B3DLC_DLC_SIZE                                     0x4
#define _B3DLC_DLC_LENGTH                                   0x4
#define _B3DLC_DLC_MASK                                     0xF
#define _B3DLC_RB_POSN                                      0x4
#define _B3DLC_RB_POSITION                                  0x4
#define _B3DLC_RB_SIZE                                      0x2
#define _B3DLC_RB_LENGTH                                    0x2
#define _B3DLC_RB_MASK                                      0x30
#define _B3DLC_RXRTR_TXRTR_POSN                             0x6
#define _B3DLC_RXRTR_TXRTR_POSITION                         0x6
#define _B3DLC_RXRTR_TXRTR_SIZE                             0x1
#define _B3DLC_RXRTR_TXRTR_LENGTH                           0x1
#define _B3DLC_RXRTR_TXRTR_MASK                             0x40
#define _B3DLC_DLC0_POSN                                    0x0
#define _B3DLC_DLC0_POSITION                                0x0
#define _B3DLC_DLC0_SIZE                                    0x1
#define _B3DLC_DLC0_LENGTH                                  0x1
#define _B3DLC_DLC0_MASK                                    0x1
#define _B3DLC_DLC1_POSN                                    0x1
#define _B3DLC_DLC1_POSITION                                0x1
#define _B3DLC_DLC1_SIZE                                    0x1
#define _B3DLC_DLC1_LENGTH                                  0x1
#define _B3DLC_DLC1_MASK                                    0x2
#define _B3DLC_DLC2_POSN                                    0x2
#define _B3DLC_DLC2_POSITION                                0x2
#define _B3DLC_DLC2_SIZE                                    0x1
#define _B3DLC_DLC2_LENGTH                                  0x1
#define _B3DLC_DLC2_MASK                                    0x4
#define _B3DLC_DLC3_POSN                                    0x3
#define _B3DLC_DLC3_POSITION                                0x3
#define _B3DLC_DLC3_SIZE                                    0x1
#define _B3DLC_DLC3_LENGTH                                  0x1
#define _B3DLC_DLC3_MASK                                    0x8
#define _B3DLC_RB0_POSN                                     0x4
#define _B3DLC_RB0_POSITION                                 0x4
#define _B3DLC_RB0_SIZE                                     0x1
#define _B3DLC_RB0_LENGTH                                   0x1
#define _B3DLC_RB0_MASK                                     0x10
#define _B3DLC_RB1_POSN                                     0x5
#define _B3DLC_RB1_POSITION                                 0x5
#define _B3DLC_RB1_SIZE                                     0x1
#define _B3DLC_RB1_LENGTH                                   0x1
#define _B3DLC_RB1_MASK                                     0x20
#define _B3DLC_RXRTR_POSN                                   0x6
#define _B3DLC_RXRTR_POSITION                               0x6
#define _B3DLC_RXRTR_SIZE                                   0x1
#define _B3DLC_RXRTR_LENGTH                                 0x1
#define _B3DLC_RXRTR_MASK                                   0x40
#define _B3DLC_TXRTR_POSN                                   0x6
#define _B3DLC_TXRTR_POSITION                               0x6
#define _B3DLC_TXRTR_SIZE                                   0x1
#define _B3DLC_TXRTR_LENGTH                                 0x1
#define _B3DLC_TXRTR_MASK                                   0x40
#define _B3DLC_B3DLC0_POSN                                  0x0
#define _B3DLC_B3DLC0_POSITION                              0x0
#define _B3DLC_B3DLC0_SIZE                                  0x1
#define _B3DLC_B3DLC0_LENGTH                                0x1
#define _B3DLC_B3DLC0_MASK                                  0x1
#define _B3DLC_B3DLC1_POSN                                  0x1
#define _B3DLC_B3DLC1_POSITION                              0x1
#define _B3DLC_B3DLC1_SIZE                                  0x1
#define _B3DLC_B3DLC1_LENGTH                                0x1
#define _B3DLC_B3DLC1_MASK                                  0x2
#define _B3DLC_B3DLC2_POSN                                  0x2
#define _B3DLC_B3DLC2_POSITION                              0x2
#define _B3DLC_B3DLC2_SIZE                                  0x1
#define _B3DLC_B3DLC2_LENGTH                                0x1
#define _B3DLC_B3DLC2_MASK                                  0x4
#define _B3DLC_B3DLC3_POSN                                  0x3
#define _B3DLC_B3DLC3_POSITION                              0x3
#define _B3DLC_B3DLC3_SIZE                                  0x1
#define _B3DLC_B3DLC3_LENGTH                                0x1
#define _B3DLC_B3DLC3_MASK                                  0x8
#define _B3DLC_B3RB0_POSN                                   0x4
#define _B3DLC_B3RB0_POSITION                               0x4
#define _B3DLC_B3RB0_SIZE                                   0x1
#define _B3DLC_B3RB0_LENGTH                                 0x1
#define _B3DLC_B3RB0_MASK                                   0x10
#define _B3DLC_B3RB1_POSN                                   0x5
#define _B3DLC_B3RB1_POSITION                               0x5
#define _B3DLC_B3RB1_SIZE                                   0x1
#define _B3DLC_B3RB1_LENGTH                                 0x1
#define _B3DLC_B3RB1_MASK                                   0x20
#define _B3DLC_B3RXRTR_POSN                                 0x6
#define _B3DLC_B3RXRTR_POSITION                             0x6
#define _B3DLC_B3RXRTR_SIZE                                 0x1
#define _B3DLC_B3RXRTR_LENGTH                               0x1
#define _B3DLC_B3RXRTR_MASK                                 0x40

// Register: B3D0
#define B3D0 B3D0
extern volatile unsigned char           B3D0                __at(0xEB6);
#ifndef _LIB_BUILD
asm("B3D0 equ 0EB6h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned B3D0                   :8;
    };
    struct {
        unsigned B3D00                  :1;
        unsigned B3D01                  :1;
        unsigned B3D02                  :1;
        unsigned B3D03                  :1;
        unsigned B3D04                  :1;
        unsigned B3D05                  :1;
        unsigned B3D06                  :1;
        unsigned B3D07                  :1;
    };
} B3D0bits_t;
