MikroElektronika/core_packages/PIC/XC8/def/PIC18LF26K80/mcu.h
extern volatile B4CONbits_t B4CONbits __at(0xEC0);
// bitfield macros
#define _B4CON_FILHIT0_TXPRI0_POSN                          0x0
#define _B4CON_FILHIT0_TXPRI0_POSITION                      0x0
#define _B4CON_FILHIT0_TXPRI0_SIZE                          0x1
#define _B4CON_FILHIT0_TXPRI0_LENGTH                        0x1
#define _B4CON_FILHIT0_TXPRI0_MASK                          0x1
#define _B4CON_FILHIT1_TXPRI1_POSN                          0x1
#define _B4CON_FILHIT1_TXPRI1_POSITION                      0x1
#define _B4CON_FILHIT1_TXPRI1_SIZE                          0x1
#define _B4CON_FILHIT1_TXPRI1_LENGTH                        0x1
#define _B4CON_FILHIT1_TXPRI1_MASK                          0x2
#define _B4CON_FILHIT2_RTREN_POSN                           0x2
#define _B4CON_FILHIT2_RTREN_POSITION                       0x2
#define _B4CON_FILHIT2_RTREN_SIZE                           0x1
#define _B4CON_FILHIT2_RTREN_LENGTH                         0x1
#define _B4CON_FILHIT2_RTREN_MASK                           0x4
#define _B4CON_FILHIT3_TXREQ_POSN                           0x3
#define _B4CON_FILHIT3_TXREQ_POSITION                       0x3
#define _B4CON_FILHIT3_TXREQ_SIZE                           0x1
#define _B4CON_FILHIT3_TXREQ_LENGTH                         0x1
#define _B4CON_FILHIT3_TXREQ_MASK                           0x8
#define _B4CON_FILHIT4_TXERR_POSN                           0x4
#define _B4CON_FILHIT4_TXERR_POSITION                       0x4
#define _B4CON_FILHIT4_TXERR_SIZE                           0x1
#define _B4CON_FILHIT4_TXERR_LENGTH                         0x1
#define _B4CON_FILHIT4_TXERR_MASK                           0x10
#define _B4CON_RXRTRRO_TXLARB_POSN                          0x5
#define _B4CON_RXRTRRO_TXLARB_POSITION                      0x5
#define _B4CON_RXRTRRO_TXLARB_SIZE                          0x1
#define _B4CON_RXRTRRO_TXLARB_LENGTH                        0x1
#define _B4CON_RXRTRRO_TXLARB_MASK                          0x20
#define _B4CON_RXM1_TXABT_POSN                              0x6
#define _B4CON_RXM1_TXABT_POSITION                          0x6
#define _B4CON_RXM1_TXABT_SIZE                              0x1
#define _B4CON_RXM1_TXABT_LENGTH                            0x1
#define _B4CON_RXM1_TXABT_MASK                              0x40
#define _B4CON_RXFUL_TXBIF_POSN                             0x7
#define _B4CON_RXFUL_TXBIF_POSITION                         0x7
#define _B4CON_RXFUL_TXBIF_SIZE                             0x1
#define _B4CON_RXFUL_TXBIF_LENGTH                           0x1
#define _B4CON_RXFUL_TXBIF_MASK                             0x80
#define _B4CON_FILHIT0_POSN                                 0x0
#define _B4CON_FILHIT0_POSITION                             0x0
#define _B4CON_FILHIT0_SIZE                                 0x1
#define _B4CON_FILHIT0_LENGTH                               0x1
#define _B4CON_FILHIT0_MASK                                 0x1
#define _B4CON_FILHIT1_POSN                                 0x1
#define _B4CON_FILHIT1_POSITION                             0x1
#define _B4CON_FILHIT1_SIZE                                 0x1
#define _B4CON_FILHIT1_LENGTH                               0x1
#define _B4CON_FILHIT1_MASK                                 0x2
#define _B4CON_FILHIT2_POSN                                 0x2
#define _B4CON_FILHIT2_POSITION                             0x2
#define _B4CON_FILHIT2_SIZE                                 0x1
#define _B4CON_FILHIT2_LENGTH                               0x1
#define _B4CON_FILHIT2_MASK                                 0x4
#define _B4CON_FILHIT3_POSN                                 0x3
#define _B4CON_FILHIT3_POSITION                             0x3
#define _B4CON_FILHIT3_SIZE                                 0x1
#define _B4CON_FILHIT3_LENGTH                               0x1
#define _B4CON_FILHIT3_MASK                                 0x8
#define _B4CON_FILHIT4_POSN                                 0x4
#define _B4CON_FILHIT4_POSITION                             0x4
#define _B4CON_FILHIT4_SIZE                                 0x1
#define _B4CON_FILHIT4_LENGTH                               0x1
#define _B4CON_FILHIT4_MASK                                 0x10
#define _B4CON_RXRTRRO_POSN                                 0x5
#define _B4CON_RXRTRRO_POSITION                             0x5
#define _B4CON_RXRTRRO_SIZE                                 0x1
#define _B4CON_RXRTRRO_LENGTH                               0x1
#define _B4CON_RXRTRRO_MASK                                 0x20
#define _B4CON_RXM1_POSN                                    0x6
#define _B4CON_RXM1_POSITION                                0x6
#define _B4CON_RXM1_SIZE                                    0x1
#define _B4CON_RXM1_LENGTH                                  0x1
#define _B4CON_RXM1_MASK                                    0x40
#define _B4CON_RXFUL_POSN                                   0x7
#define _B4CON_RXFUL_POSITION                               0x7
#define _B4CON_RXFUL_SIZE                                   0x1
#define _B4CON_RXFUL_LENGTH                                 0x1
#define _B4CON_RXFUL_MASK                                   0x80
#define _B4CON_TXPRI0_POSN                                  0x0
#define _B4CON_TXPRI0_POSITION                              0x0
#define _B4CON_TXPRI0_SIZE                                  0x1
#define _B4CON_TXPRI0_LENGTH                                0x1
#define _B4CON_TXPRI0_MASK                                  0x1
#define _B4CON_TXPRI1_POSN                                  0x1
#define _B4CON_TXPRI1_POSITION                              0x1
#define _B4CON_TXPRI1_SIZE                                  0x1
#define _B4CON_TXPRI1_LENGTH                                0x1
#define _B4CON_TXPRI1_MASK                                  0x2
#define _B4CON_RTREN_POSN                                   0x2
#define _B4CON_RTREN_POSITION                               0x2
#define _B4CON_RTREN_SIZE                                   0x1
#define _B4CON_RTREN_LENGTH                                 0x1
#define _B4CON_RTREN_MASK                                   0x4
#define _B4CON_TXREQ_POSN                                   0x3
#define _B4CON_TXREQ_POSITION                               0x3
#define _B4CON_TXREQ_SIZE                                   0x1
#define _B4CON_TXREQ_LENGTH                                 0x1
#define _B4CON_TXREQ_MASK                                   0x8
#define _B4CON_TXERR_POSN                                   0x4
#define _B4CON_TXERR_POSITION                               0x4
#define _B4CON_TXERR_SIZE                                   0x1
#define _B4CON_TXERR_LENGTH                                 0x1
#define _B4CON_TXERR_MASK                                   0x10
#define _B4CON_TXLARB_POSN                                  0x5
#define _B4CON_TXLARB_POSITION                              0x5
#define _B4CON_TXLARB_SIZE                                  0x1
#define _B4CON_TXLARB_LENGTH                                0x1
#define _B4CON_TXLARB_MASK                                  0x20
#define _B4CON_TXABT_POSN                                   0x6
#define _B4CON_TXABT_POSITION                               0x6
#define _B4CON_TXABT_SIZE                                   0x1
#define _B4CON_TXABT_LENGTH                                 0x1
#define _B4CON_TXABT_MASK                                   0x40
#define _B4CON_TXBIF_POSN                                   0x7
#define _B4CON_TXBIF_POSITION                               0x7
#define _B4CON_TXBIF_SIZE                                   0x1
#define _B4CON_TXBIF_LENGTH                                 0x1
#define _B4CON_TXBIF_MASK                                   0x80
#define _B4CON_B4FILHIT0_POSN                               0x0
#define _B4CON_B4FILHIT0_POSITION                           0x0
#define _B4CON_B4FILHIT0_SIZE                               0x1
#define _B4CON_B4FILHIT0_LENGTH                             0x1
#define _B4CON_B4FILHIT0_MASK                               0x1
#define _B4CON_B4FILHIT1_POSN                               0x1
#define _B4CON_B4FILHIT1_POSITION                           0x1
#define _B4CON_B4FILHIT1_SIZE                               0x1
#define _B4CON_B4FILHIT1_LENGTH                             0x1
#define _B4CON_B4FILHIT1_MASK                               0x2
#define _B4CON_B4FILHIT2_POSN                               0x2
#define _B4CON_B4FILHIT2_POSITION                           0x2
#define _B4CON_B4FILHIT2_SIZE                               0x1
#define _B4CON_B4FILHIT2_LENGTH                             0x1
#define _B4CON_B4FILHIT2_MASK                               0x4
#define _B4CON_B4FILHIT3_POSN                               0x3
#define _B4CON_B4FILHIT3_POSITION                           0x3
#define _B4CON_B4FILHIT3_SIZE                               0x1
#define _B4CON_B4FILHIT3_LENGTH                             0x1
#define _B4CON_B4FILHIT3_MASK                               0x8
#define _B4CON_B4FILHIT4_POSN                               0x4
#define _B4CON_B4FILHIT4_POSITION                           0x4
#define _B4CON_B4FILHIT4_SIZE                               0x1
#define _B4CON_B4FILHIT4_LENGTH                             0x1
#define _B4CON_B4FILHIT4_MASK                               0x10
#define _B4CON_B4RTRRO_POSN                                 0x5
#define _B4CON_B4RTRRO_POSITION                             0x5
#define _B4CON_B4RTRRO_SIZE                                 0x1
#define _B4CON_B4RTRRO_LENGTH                               0x1
#define _B4CON_B4RTRRO_MASK                                 0x20
#define _B4CON_B4RXM1_POSN                                  0x6
#define _B4CON_B4RXM1_POSITION                              0x6
#define _B4CON_B4RXM1_SIZE                                  0x1
#define _B4CON_B4RXM1_LENGTH                                0x1
#define _B4CON_B4RXM1_MASK                                  0x40
#define _B4CON_B4RXFUL_POSN                                 0x7
#define _B4CON_B4RXFUL_POSITION                             0x7
#define _B4CON_B4RXFUL_SIZE                                 0x1
#define _B4CON_B4RXFUL_LENGTH                               0x1
#define _B4CON_B4RXFUL_MASK                                 0x80
#define _B4CON_B4TXPRI0_POSN                                0x0
#define _B4CON_B4TXPRI0_POSITION                            0x0
#define _B4CON_B4TXPRI0_SIZE                                0x1
#define _B4CON_B4TXPRI0_LENGTH                              0x1
#define _B4CON_B4TXPRI0_MASK                                0x1
#define _B4CON_B4TXPRI1_POSN                                0x1
#define _B4CON_B4TXPRI1_POSITION                            0x1
#define _B4CON_B4TXPRI1_SIZE                                0x1
#define _B4CON_B4TXPRI1_LENGTH                              0x1
#define _B4CON_B4TXPRI1_MASK                                0x2
#define _B4CON_B4RTREN_POSN                                 0x2
#define _B4CON_B4RTREN_POSITION                             0x2
#define _B4CON_B4RTREN_SIZE                                 0x1
#define _B4CON_B4RTREN_LENGTH                               0x1
#define _B4CON_B4RTREN_MASK                                 0x4
#define _B4CON_B4TXREQ_POSN                                 0x3
#define _B4CON_B4TXREQ_POSITION                             0x3
#define _B4CON_B4TXREQ_SIZE                                 0x1
#define _B4CON_B4TXREQ_LENGTH                               0x1
#define _B4CON_B4TXREQ_MASK                                 0x8
#define _B4CON_B4TXERR_POSN                                 0x4
#define _B4CON_B4TXERR_POSITION                             0x4
#define _B4CON_B4TXERR_SIZE                                 0x1
#define _B4CON_B4TXERR_LENGTH                               0x1
#define _B4CON_B4TXERR_MASK                                 0x10
#define _B4CON_B4TXLARB_POSN                                0x5
#define _B4CON_B4TXLARB_POSITION                            0x5
#define _B4CON_B4TXLARB_SIZE                                0x1
#define _B4CON_B4TXLARB_LENGTH                              0x1
#define _B4CON_B4TXLARB_MASK                                0x20
#define _B4CON_B4TXABT_POSN                                 0x6
#define _B4CON_B4TXABT_POSITION                             0x6
#define _B4CON_B4TXABT_SIZE                                 0x1
#define _B4CON_B4TXABT_LENGTH                               0x1
#define _B4CON_B4TXABT_MASK                                 0x40
#define _B4CON_B4TXB3IF_POSN                                0x7
#define _B4CON_B4TXB3IF_POSITION                            0x7
#define _B4CON_B4TXB3IF_SIZE                                0x1
#define _B4CON_B4TXB3IF_LENGTH                              0x1
#define _B4CON_B4TXB3IF_MASK                                0x80

// Register: B4SIDH
#define B4SIDH B4SIDH
extern volatile unsigned char           B4SIDH              __at(0xEC1);
#ifndef _LIB_BUILD
asm("B4SIDH equ 0EC1h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SID                    :8;
    };
    struct {
        unsigned SID3                   :1;
        unsigned SID4                   :1;
        unsigned SID5                   :1;
        unsigned SID6                   :1;
        unsigned SID7                   :1;
        unsigned SID8                   :1;
        unsigned SID9                   :1;
        unsigned SID10                  :1;
    };
    struct {
        unsigned B4SID3                 :1;
        unsigned B4SID4                 :1;
        unsigned B4SID5                 :1;
        unsigned B4SID6                 :1;
        unsigned B4SID7                 :1;
        unsigned B4SID8                 :1;
        unsigned B4SID9                 :1;
        unsigned B4SID10                :1;
    };
} B4SIDHbits_t;
extern volatile B4SIDHbits_t B4SIDHbits __at(0xEC1);
// bitfield macros
#define _B4SIDH_SID_POSN                                    0x0
#define _B4SIDH_SID_POSITION                                0x0
#define _B4SIDH_SID_SIZE                                    0x8
#define _B4SIDH_SID_LENGTH                                  0x8
#define _B4SIDH_SID_MASK                                    0xFF
#define _B4SIDH_SID3_POSN                                   0x0
#define _B4SIDH_SID3_POSITION                               0x0
#define _B4SIDH_SID3_SIZE                                   0x1
#define _B4SIDH_SID3_LENGTH                                 0x1
#define _B4SIDH_SID3_MASK                                   0x1
#define _B4SIDH_SID4_POSN                                   0x1
#define _B4SIDH_SID4_POSITION                               0x1
#define _B4SIDH_SID4_SIZE                                   0x1
#define _B4SIDH_SID4_LENGTH                                 0x1
#define _B4SIDH_SID4_MASK                                   0x2
#define _B4SIDH_SID5_POSN                                   0x2
#define _B4SIDH_SID5_POSITION                               0x2
#define _B4SIDH_SID5_SIZE                                   0x1
#define _B4SIDH_SID5_LENGTH                                 0x1
#define _B4SIDH_SID5_MASK                                   0x4
#define _B4SIDH_SID6_POSN                                   0x3
#define _B4SIDH_SID6_POSITION                               0x3
#define _B4SIDH_SID6_SIZE                                   0x1
#define _B4SIDH_SID6_LENGTH                                 0x1
#define _B4SIDH_SID6_MASK                                   0x8
#define _B4SIDH_SID7_POSN                                   0x4
#define _B4SIDH_SID7_POSITION                               0x4
#define _B4SIDH_SID7_SIZE                                   0x1
#define _B4SIDH_SID7_LENGTH                                 0x1
#define _B4SIDH_SID7_MASK                                   0x10
#define _B4SIDH_SID8_POSN                                   0x5
#define _B4SIDH_SID8_POSITION                               0x5
#define _B4SIDH_SID8_SIZE                                   0x1
#define _B4SIDH_SID8_LENGTH                                 0x1
#define _B4SIDH_SID8_MASK                                   0x20
#define _B4SIDH_SID9_POSN                                   0x6
#define _B4SIDH_SID9_POSITION                               0x6
#define _B4SIDH_SID9_SIZE                                   0x1
#define _B4SIDH_SID9_LENGTH                                 0x1
#define _B4SIDH_SID9_MASK                                   0x40
#define _B4SIDH_SID10_POSN                                  0x7
#define _B4SIDH_SID10_POSITION                              0x7
#define _B4SIDH_SID10_SIZE                                  0x1
#define _B4SIDH_SID10_LENGTH                                0x1
#define _B4SIDH_SID10_MASK                                  0x80
#define _B4SIDH_B4SID3_POSN                                 0x0
#define _B4SIDH_B4SID3_POSITION                             0x0
#define _B4SIDH_B4SID3_SIZE                                 0x1
#define _B4SIDH_B4SID3_LENGTH                               0x1
#define _B4SIDH_B4SID3_MASK                                 0x1
#define _B4SIDH_B4SID4_POSN                                 0x1
#define _B4SIDH_B4SID4_POSITION                             0x1
#define _B4SIDH_B4SID4_SIZE                                 0x1
#define _B4SIDH_B4SID4_LENGTH                               0x1
#define _B4SIDH_B4SID4_MASK                                 0x2
#define _B4SIDH_B4SID5_POSN                                 0x2
#define _B4SIDH_B4SID5_POSITION                             0x2
#define _B4SIDH_B4SID5_SIZE                                 0x1
#define _B4SIDH_B4SID5_LENGTH                               0x1
#define _B4SIDH_B4SID5_MASK                                 0x4
#define _B4SIDH_B4SID6_POSN                                 0x3
#define _B4SIDH_B4SID6_POSITION                             0x3
#define _B4SIDH_B4SID6_SIZE                                 0x1
#define _B4SIDH_B4SID6_LENGTH                               0x1
#define _B4SIDH_B4SID6_MASK                                 0x8
#define _B4SIDH_B4SID7_POSN                                 0x4
#define _B4SIDH_B4SID7_POSITION                             0x4
#define _B4SIDH_B4SID7_SIZE                                 0x1
#define _B4SIDH_B4SID7_LENGTH                               0x1
#define _B4SIDH_B4SID7_MASK                                 0x10
#define _B4SIDH_B4SID8_POSN                                 0x5
#define _B4SIDH_B4SID8_POSITION                             0x5
#define _B4SIDH_B4SID8_SIZE                                 0x1
#define _B4SIDH_B4SID8_LENGTH                               0x1
#define _B4SIDH_B4SID8_MASK                                 0x20
#define _B4SIDH_B4SID9_POSN                                 0x6
#define _B4SIDH_B4SID9_POSITION                             0x6
#define _B4SIDH_B4SID9_SIZE                                 0x1
#define _B4SIDH_B4SID9_LENGTH                               0x1
#define _B4SIDH_B4SID9_MASK                                 0x40
#define _B4SIDH_B4SID10_POSN                                0x7
#define _B4SIDH_B4SID10_POSITION                            0x7
#define _B4SIDH_B4SID10_SIZE                                0x1
#define _B4SIDH_B4SID10_LENGTH                              0x1
#define _B4SIDH_B4SID10_MASK                                0x80

