MikroElektronika/core_packages/PIC/XC8/def/PIC18LF26K80/mcu.h
extern volatile RXF3SIDLbits_t RXF3SIDLbits __at(0xEED);
// bitfield macros
#define _RXF3SIDL_EID_POSN                                  0x0
#define _RXF3SIDL_EID_POSITION                              0x0
#define _RXF3SIDL_EID_SIZE                                  0x2
#define _RXF3SIDL_EID_LENGTH                                0x2
#define _RXF3SIDL_EID_MASK                                  0x3
#define _RXF3SIDL_EXIDEN_POSN                               0x3
#define _RXF3SIDL_EXIDEN_POSITION                           0x3
#define _RXF3SIDL_EXIDEN_SIZE                               0x1
#define _RXF3SIDL_EXIDEN_LENGTH                             0x1
#define _RXF3SIDL_EXIDEN_MASK                               0x8
#define _RXF3SIDL_SID_POSN                                  0x5
#define _RXF3SIDL_SID_POSITION                              0x5
#define _RXF3SIDL_SID_SIZE                                  0x3
#define _RXF3SIDL_SID_LENGTH                                0x3
#define _RXF3SIDL_SID_MASK                                  0xE0
#define _RXF3SIDL_EID16_POSN                                0x0
#define _RXF3SIDL_EID16_POSITION                            0x0
#define _RXF3SIDL_EID16_SIZE                                0x1
#define _RXF3SIDL_EID16_LENGTH                              0x1
#define _RXF3SIDL_EID16_MASK                                0x1
#define _RXF3SIDL_EID17_POSN                                0x1
#define _RXF3SIDL_EID17_POSITION                            0x1
#define _RXF3SIDL_EID17_SIZE                                0x1
#define _RXF3SIDL_EID17_LENGTH                              0x1
#define _RXF3SIDL_EID17_MASK                                0x2
#define _RXF3SIDL_SID0_POSN                                 0x5
#define _RXF3SIDL_SID0_POSITION                             0x5
#define _RXF3SIDL_SID0_SIZE                                 0x1
#define _RXF3SIDL_SID0_LENGTH                               0x1
#define _RXF3SIDL_SID0_MASK                                 0x20
#define _RXF3SIDL_SID1_POSN                                 0x6
#define _RXF3SIDL_SID1_POSITION                             0x6
#define _RXF3SIDL_SID1_SIZE                                 0x1
#define _RXF3SIDL_SID1_LENGTH                               0x1
#define _RXF3SIDL_SID1_MASK                                 0x40
#define _RXF3SIDL_SID2_POSN                                 0x7
#define _RXF3SIDL_SID2_POSITION                             0x7
#define _RXF3SIDL_SID2_SIZE                                 0x1
#define _RXF3SIDL_SID2_LENGTH                               0x1
#define _RXF3SIDL_SID2_MASK                                 0x80
#define _RXF3SIDL_RXF3EID16_POSN                            0x0
#define _RXF3SIDL_RXF3EID16_POSITION                        0x0
#define _RXF3SIDL_RXF3EID16_SIZE                            0x1
#define _RXF3SIDL_RXF3EID16_LENGTH                          0x1
#define _RXF3SIDL_RXF3EID16_MASK                            0x1
#define _RXF3SIDL_RXF3EID17_POSN                            0x1
#define _RXF3SIDL_RXF3EID17_POSITION                        0x1
#define _RXF3SIDL_RXF3EID17_SIZE                            0x1
#define _RXF3SIDL_RXF3EID17_LENGTH                          0x1
#define _RXF3SIDL_RXF3EID17_MASK                            0x2
#define _RXF3SIDL_RXF3EXIDEN_POSN                           0x3
#define _RXF3SIDL_RXF3EXIDEN_POSITION                       0x3
#define _RXF3SIDL_RXF3EXIDEN_SIZE                           0x1
#define _RXF3SIDL_RXF3EXIDEN_LENGTH                         0x1
#define _RXF3SIDL_RXF3EXIDEN_MASK                           0x8
#define _RXF3SIDL_RXF3SID0_POSN                             0x5
#define _RXF3SIDL_RXF3SID0_POSITION                         0x5
#define _RXF3SIDL_RXF3SID0_SIZE                             0x1
#define _RXF3SIDL_RXF3SID0_LENGTH                           0x1
#define _RXF3SIDL_RXF3SID0_MASK                             0x20
#define _RXF3SIDL_RXF3SID1_POSN                             0x6
#define _RXF3SIDL_RXF3SID1_POSITION                         0x6
#define _RXF3SIDL_RXF3SID1_SIZE                             0x1
#define _RXF3SIDL_RXF3SID1_LENGTH                           0x1
#define _RXF3SIDL_RXF3SID1_MASK                             0x40
#define _RXF3SIDL_RXF3SID2_POSN                             0x7
#define _RXF3SIDL_RXF3SID2_POSITION                         0x7
#define _RXF3SIDL_RXF3SID2_SIZE                             0x1
#define _RXF3SIDL_RXF3SID2_LENGTH                           0x1
#define _RXF3SIDL_RXF3SID2_MASK                             0x80

// Register: RXF3EIDH
#define RXF3EIDH RXF3EIDH
extern volatile unsigned char           RXF3EIDH            __at(0xEEE);
#ifndef _LIB_BUILD
asm("RXF3EIDH equ 0EEEh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned EID                    :8;
    };
    struct {
        unsigned EID8                   :1;
        unsigned EID9                   :1;
        unsigned EID10                  :1;
        unsigned EID11                  :1;
        unsigned EID12                  :1;
        unsigned EID13                  :1;
        unsigned EID14                  :1;
        unsigned EID15                  :1;
    };
    struct {
        unsigned RXF3EID8               :1;
        unsigned RXF3EID9               :1;
        unsigned RXF3EID10              :1;
        unsigned RXF3EID11              :1;
        unsigned RXF3EID12              :1;
        unsigned RXF3EID13              :1;
        unsigned RXF3EID14              :1;
        unsigned RXF3EID15              :1;
    };
} RXF3EIDHbits_t;
extern volatile RXF3EIDHbits_t RXF3EIDHbits __at(0xEEE);
// bitfield macros
#define _RXF3EIDH_EID_POSN                                  0x0
#define _RXF3EIDH_EID_POSITION                              0x0
#define _RXF3EIDH_EID_SIZE                                  0x8
#define _RXF3EIDH_EID_LENGTH                                0x8
#define _RXF3EIDH_EID_MASK                                  0xFF
#define _RXF3EIDH_EID8_POSN                                 0x0
#define _RXF3EIDH_EID8_POSITION                             0x0
#define _RXF3EIDH_EID8_SIZE                                 0x1
#define _RXF3EIDH_EID8_LENGTH                               0x1
#define _RXF3EIDH_EID8_MASK                                 0x1
#define _RXF3EIDH_EID9_POSN                                 0x1
#define _RXF3EIDH_EID9_POSITION                             0x1
#define _RXF3EIDH_EID9_SIZE                                 0x1
#define _RXF3EIDH_EID9_LENGTH                               0x1
#define _RXF3EIDH_EID9_MASK                                 0x2
#define _RXF3EIDH_EID10_POSN                                0x2
#define _RXF3EIDH_EID10_POSITION                            0x2
#define _RXF3EIDH_EID10_SIZE                                0x1
#define _RXF3EIDH_EID10_LENGTH                              0x1
#define _RXF3EIDH_EID10_MASK                                0x4
#define _RXF3EIDH_EID11_POSN                                0x3
#define _RXF3EIDH_EID11_POSITION                            0x3
#define _RXF3EIDH_EID11_SIZE                                0x1
#define _RXF3EIDH_EID11_LENGTH                              0x1
#define _RXF3EIDH_EID11_MASK                                0x8
#define _RXF3EIDH_EID12_POSN                                0x4
#define _RXF3EIDH_EID12_POSITION                            0x4
#define _RXF3EIDH_EID12_SIZE                                0x1
#define _RXF3EIDH_EID12_LENGTH                              0x1
#define _RXF3EIDH_EID12_MASK                                0x10
#define _RXF3EIDH_EID13_POSN                                0x5
#define _RXF3EIDH_EID13_POSITION                            0x5
#define _RXF3EIDH_EID13_SIZE                                0x1
#define _RXF3EIDH_EID13_LENGTH                              0x1
#define _RXF3EIDH_EID13_MASK                                0x20
#define _RXF3EIDH_EID14_POSN                                0x6
#define _RXF3EIDH_EID14_POSITION                            0x6
#define _RXF3EIDH_EID14_SIZE                                0x1
#define _RXF3EIDH_EID14_LENGTH                              0x1
#define _RXF3EIDH_EID14_MASK                                0x40
#define _RXF3EIDH_EID15_POSN                                0x7
#define _RXF3EIDH_EID15_POSITION                            0x7
#define _RXF3EIDH_EID15_SIZE                                0x1
#define _RXF3EIDH_EID15_LENGTH                              0x1
#define _RXF3EIDH_EID15_MASK                                0x80
#define _RXF3EIDH_RXF3EID8_POSN                             0x0
#define _RXF3EIDH_RXF3EID8_POSITION                         0x0
#define _RXF3EIDH_RXF3EID8_SIZE                             0x1
#define _RXF3EIDH_RXF3EID8_LENGTH                           0x1
#define _RXF3EIDH_RXF3EID8_MASK                             0x1
#define _RXF3EIDH_RXF3EID9_POSN                             0x1
#define _RXF3EIDH_RXF3EID9_POSITION                         0x1
#define _RXF3EIDH_RXF3EID9_SIZE                             0x1
#define _RXF3EIDH_RXF3EID9_LENGTH                           0x1
#define _RXF3EIDH_RXF3EID9_MASK                             0x2
#define _RXF3EIDH_RXF3EID10_POSN                            0x2
#define _RXF3EIDH_RXF3EID10_POSITION                        0x2
#define _RXF3EIDH_RXF3EID10_SIZE                            0x1
#define _RXF3EIDH_RXF3EID10_LENGTH                          0x1
#define _RXF3EIDH_RXF3EID10_MASK                            0x4
#define _RXF3EIDH_RXF3EID11_POSN                            0x3
#define _RXF3EIDH_RXF3EID11_POSITION                        0x3
#define _RXF3EIDH_RXF3EID11_SIZE                            0x1
#define _RXF3EIDH_RXF3EID11_LENGTH                          0x1
#define _RXF3EIDH_RXF3EID11_MASK                            0x8
#define _RXF3EIDH_RXF3EID12_POSN                            0x4
#define _RXF3EIDH_RXF3EID12_POSITION                        0x4
#define _RXF3EIDH_RXF3EID12_SIZE                            0x1
#define _RXF3EIDH_RXF3EID12_LENGTH                          0x1
#define _RXF3EIDH_RXF3EID12_MASK                            0x10
#define _RXF3EIDH_RXF3EID13_POSN                            0x5
#define _RXF3EIDH_RXF3EID13_POSITION                        0x5
#define _RXF3EIDH_RXF3EID13_SIZE                            0x1
#define _RXF3EIDH_RXF3EID13_LENGTH                          0x1
#define _RXF3EIDH_RXF3EID13_MASK                            0x20
#define _RXF3EIDH_RXF3EID14_POSN                            0x6
#define _RXF3EIDH_RXF3EID14_POSITION                        0x6
#define _RXF3EIDH_RXF3EID14_SIZE                            0x1
#define _RXF3EIDH_RXF3EID14_LENGTH                          0x1
#define _RXF3EIDH_RXF3EID14_MASK                            0x40
#define _RXF3EIDH_RXF3EID15_POSN                            0x7
#define _RXF3EIDH_RXF3EID15_POSITION                        0x7
#define _RXF3EIDH_RXF3EID15_SIZE                            0x1
#define _RXF3EIDH_RXF3EID15_LENGTH                          0x1
#define _RXF3EIDH_RXF3EID15_MASK                            0x80

// Register: RXF3EIDL
#define RXF3EIDL RXF3EIDL
extern volatile unsigned char           RXF3EIDL            __at(0xEEF);
#ifndef _LIB_BUILD
asm("RXF3EIDL equ 0EEFh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned EID                    :8;
    };
    struct {
        unsigned EID0                   :1;
        unsigned EID1                   :1;
        unsigned EID2                   :1;
        unsigned EID3                   :1;
        unsigned EID4                   :1;
        unsigned EID5                   :1;
        unsigned EID6                   :1;
        unsigned EID7                   :1;
    };
    struct {
        unsigned RXF3EID0               :1;
        unsigned RXF3EID1               :1;
        unsigned RXF3EID2               :1;
        unsigned RXF3EID3               :1;
        unsigned RXF3EID4               :1;
        unsigned RXF3EID5               :1;
        unsigned RXF3EID6               :1;
        unsigned RXF3EID7               :1;
    };
} RXF3EIDLbits_t;
