MikroElektronika/core_packages/PIC/XC8/def/PIC18LF26K80/mcu.h
extern volatile RXF5EIDHbits_t RXF5EIDHbits __at(0xEF6);
// bitfield macros
#define _RXF5EIDH_EID_POSN                                  0x0
#define _RXF5EIDH_EID_POSITION                              0x0
#define _RXF5EIDH_EID_SIZE                                  0x8
#define _RXF5EIDH_EID_LENGTH                                0x8
#define _RXF5EIDH_EID_MASK                                  0xFF
#define _RXF5EIDH_EID8_POSN                                 0x0
#define _RXF5EIDH_EID8_POSITION                             0x0
#define _RXF5EIDH_EID8_SIZE                                 0x1
#define _RXF5EIDH_EID8_LENGTH                               0x1
#define _RXF5EIDH_EID8_MASK                                 0x1
#define _RXF5EIDH_EID9_POSN                                 0x1
#define _RXF5EIDH_EID9_POSITION                             0x1
#define _RXF5EIDH_EID9_SIZE                                 0x1
#define _RXF5EIDH_EID9_LENGTH                               0x1
#define _RXF5EIDH_EID9_MASK                                 0x2
#define _RXF5EIDH_EID10_POSN                                0x2
#define _RXF5EIDH_EID10_POSITION                            0x2
#define _RXF5EIDH_EID10_SIZE                                0x1
#define _RXF5EIDH_EID10_LENGTH                              0x1
#define _RXF5EIDH_EID10_MASK                                0x4
#define _RXF5EIDH_EID11_POSN                                0x3
#define _RXF5EIDH_EID11_POSITION                            0x3
#define _RXF5EIDH_EID11_SIZE                                0x1
#define _RXF5EIDH_EID11_LENGTH                              0x1
#define _RXF5EIDH_EID11_MASK                                0x8
#define _RXF5EIDH_EID12_POSN                                0x4
#define _RXF5EIDH_EID12_POSITION                            0x4
#define _RXF5EIDH_EID12_SIZE                                0x1
#define _RXF5EIDH_EID12_LENGTH                              0x1
#define _RXF5EIDH_EID12_MASK                                0x10
#define _RXF5EIDH_EID13_POSN                                0x5
#define _RXF5EIDH_EID13_POSITION                            0x5
#define _RXF5EIDH_EID13_SIZE                                0x1
#define _RXF5EIDH_EID13_LENGTH                              0x1
#define _RXF5EIDH_EID13_MASK                                0x20
#define _RXF5EIDH_EID14_POSN                                0x6
#define _RXF5EIDH_EID14_POSITION                            0x6
#define _RXF5EIDH_EID14_SIZE                                0x1
#define _RXF5EIDH_EID14_LENGTH                              0x1
#define _RXF5EIDH_EID14_MASK                                0x40
#define _RXF5EIDH_EID15_POSN                                0x7
#define _RXF5EIDH_EID15_POSITION                            0x7
#define _RXF5EIDH_EID15_SIZE                                0x1
#define _RXF5EIDH_EID15_LENGTH                              0x1
#define _RXF5EIDH_EID15_MASK                                0x80
#define _RXF5EIDH_RXF5EID8_POSN                             0x0
#define _RXF5EIDH_RXF5EID8_POSITION                         0x0
#define _RXF5EIDH_RXF5EID8_SIZE                             0x1
#define _RXF5EIDH_RXF5EID8_LENGTH                           0x1
#define _RXF5EIDH_RXF5EID8_MASK                             0x1
#define _RXF5EIDH_RXF5EID9_POSN                             0x1
#define _RXF5EIDH_RXF5EID9_POSITION                         0x1
#define _RXF5EIDH_RXF5EID9_SIZE                             0x1
#define _RXF5EIDH_RXF5EID9_LENGTH                           0x1
#define _RXF5EIDH_RXF5EID9_MASK                             0x2
#define _RXF5EIDH_RXF5EID10_POSN                            0x2
#define _RXF5EIDH_RXF5EID10_POSITION                        0x2
#define _RXF5EIDH_RXF5EID10_SIZE                            0x1
#define _RXF5EIDH_RXF5EID10_LENGTH                          0x1
#define _RXF5EIDH_RXF5EID10_MASK                            0x4
#define _RXF5EIDH_RXF5EID11_POSN                            0x3
#define _RXF5EIDH_RXF5EID11_POSITION                        0x3
#define _RXF5EIDH_RXF5EID11_SIZE                            0x1
#define _RXF5EIDH_RXF5EID11_LENGTH                          0x1
#define _RXF5EIDH_RXF5EID11_MASK                            0x8
#define _RXF5EIDH_RXF5EID12_POSN                            0x4
#define _RXF5EIDH_RXF5EID12_POSITION                        0x4
#define _RXF5EIDH_RXF5EID12_SIZE                            0x1
#define _RXF5EIDH_RXF5EID12_LENGTH                          0x1
#define _RXF5EIDH_RXF5EID12_MASK                            0x10
#define _RXF5EIDH_RXF5EID13_POSN                            0x5
#define _RXF5EIDH_RXF5EID13_POSITION                        0x5
#define _RXF5EIDH_RXF5EID13_SIZE                            0x1
#define _RXF5EIDH_RXF5EID13_LENGTH                          0x1
#define _RXF5EIDH_RXF5EID13_MASK                            0x20
#define _RXF5EIDH_RXF5EID14_POSN                            0x6
#define _RXF5EIDH_RXF5EID14_POSITION                        0x6
#define _RXF5EIDH_RXF5EID14_SIZE                            0x1
#define _RXF5EIDH_RXF5EID14_LENGTH                          0x1
#define _RXF5EIDH_RXF5EID14_MASK                            0x40
#define _RXF5EIDH_RXF5EID15_POSN                            0x7
#define _RXF5EIDH_RXF5EID15_POSITION                        0x7
#define _RXF5EIDH_RXF5EID15_SIZE                            0x1
#define _RXF5EIDH_RXF5EID15_LENGTH                          0x1
#define _RXF5EIDH_RXF5EID15_MASK                            0x80

// Register: RXF5EIDL
#define RXF5EIDL RXF5EIDL
extern volatile unsigned char           RXF5EIDL            __at(0xEF7);
#ifndef _LIB_BUILD
asm("RXF5EIDL equ 0EF7h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned EID                    :8;
    };
    struct {
        unsigned EID0                   :1;
        unsigned EID1                   :1;
        unsigned EID2                   :1;
        unsigned EID3                   :1;
        unsigned EID4                   :1;
        unsigned EID5                   :1;
        unsigned EID6                   :1;
        unsigned EID7                   :1;
    };
    struct {
        unsigned RXF5EID0               :1;
        unsigned RXF5EID1               :1;
        unsigned RXF5EID2               :1;
        unsigned RXF5EID3               :1;
        unsigned RXF5EID4               :1;
        unsigned RXF5EID5               :1;
        unsigned RXF5EID6               :1;
        unsigned RXF5EID7               :1;
    };
} RXF5EIDLbits_t;
extern volatile RXF5EIDLbits_t RXF5EIDLbits __at(0xEF7);
// bitfield macros
#define _RXF5EIDL_EID_POSN                                  0x0
#define _RXF5EIDL_EID_POSITION                              0x0
#define _RXF5EIDL_EID_SIZE                                  0x8
#define _RXF5EIDL_EID_LENGTH                                0x8
#define _RXF5EIDL_EID_MASK                                  0xFF
#define _RXF5EIDL_EID0_POSN                                 0x0
#define _RXF5EIDL_EID0_POSITION                             0x0
#define _RXF5EIDL_EID0_SIZE                                 0x1
#define _RXF5EIDL_EID0_LENGTH                               0x1
#define _RXF5EIDL_EID0_MASK                                 0x1
#define _RXF5EIDL_EID1_POSN                                 0x1
#define _RXF5EIDL_EID1_POSITION                             0x1
#define _RXF5EIDL_EID1_SIZE                                 0x1
#define _RXF5EIDL_EID1_LENGTH                               0x1
#define _RXF5EIDL_EID1_MASK                                 0x2
#define _RXF5EIDL_EID2_POSN                                 0x2
#define _RXF5EIDL_EID2_POSITION                             0x2
#define _RXF5EIDL_EID2_SIZE                                 0x1
#define _RXF5EIDL_EID2_LENGTH                               0x1
#define _RXF5EIDL_EID2_MASK                                 0x4
#define _RXF5EIDL_EID3_POSN                                 0x3
#define _RXF5EIDL_EID3_POSITION                             0x3
#define _RXF5EIDL_EID3_SIZE                                 0x1
#define _RXF5EIDL_EID3_LENGTH                               0x1
#define _RXF5EIDL_EID3_MASK                                 0x8
#define _RXF5EIDL_EID4_POSN                                 0x4
#define _RXF5EIDL_EID4_POSITION                             0x4
#define _RXF5EIDL_EID4_SIZE                                 0x1
#define _RXF5EIDL_EID4_LENGTH                               0x1
#define _RXF5EIDL_EID4_MASK                                 0x10
#define _RXF5EIDL_EID5_POSN                                 0x5
#define _RXF5EIDL_EID5_POSITION                             0x5
#define _RXF5EIDL_EID5_SIZE                                 0x1
#define _RXF5EIDL_EID5_LENGTH                               0x1
#define _RXF5EIDL_EID5_MASK                                 0x20
#define _RXF5EIDL_EID6_POSN                                 0x6
#define _RXF5EIDL_EID6_POSITION                             0x6
#define _RXF5EIDL_EID6_SIZE                                 0x1
#define _RXF5EIDL_EID6_LENGTH                               0x1
#define _RXF5EIDL_EID6_MASK                                 0x40
#define _RXF5EIDL_EID7_POSN                                 0x7
#define _RXF5EIDL_EID7_POSITION                             0x7
#define _RXF5EIDL_EID7_SIZE                                 0x1
#define _RXF5EIDL_EID7_LENGTH                               0x1
#define _RXF5EIDL_EID7_MASK                                 0x80
#define _RXF5EIDL_RXF5EID0_POSN                             0x0
#define _RXF5EIDL_RXF5EID0_POSITION                         0x0
#define _RXF5EIDL_RXF5EID0_SIZE                             0x1
#define _RXF5EIDL_RXF5EID0_LENGTH                           0x1
#define _RXF5EIDL_RXF5EID0_MASK                             0x1
#define _RXF5EIDL_RXF5EID1_POSN                             0x1
#define _RXF5EIDL_RXF5EID1_POSITION                         0x1
#define _RXF5EIDL_RXF5EID1_SIZE                             0x1
#define _RXF5EIDL_RXF5EID1_LENGTH                           0x1
#define _RXF5EIDL_RXF5EID1_MASK                             0x2
#define _RXF5EIDL_RXF5EID2_POSN                             0x2
#define _RXF5EIDL_RXF5EID2_POSITION                         0x2
#define _RXF5EIDL_RXF5EID2_SIZE                             0x1
#define _RXF5EIDL_RXF5EID2_LENGTH                           0x1
#define _RXF5EIDL_RXF5EID2_MASK                             0x4
#define _RXF5EIDL_RXF5EID3_POSN                             0x3
#define _RXF5EIDL_RXF5EID3_POSITION                         0x3
#define _RXF5EIDL_RXF5EID3_SIZE                             0x1
#define _RXF5EIDL_RXF5EID3_LENGTH                           0x1
#define _RXF5EIDL_RXF5EID3_MASK                             0x8
#define _RXF5EIDL_RXF5EID4_POSN                             0x4
#define _RXF5EIDL_RXF5EID4_POSITION                         0x4
#define _RXF5EIDL_RXF5EID4_SIZE                             0x1
#define _RXF5EIDL_RXF5EID4_LENGTH                           0x1
#define _RXF5EIDL_RXF5EID4_MASK                             0x10
#define _RXF5EIDL_RXF5EID5_POSN                             0x5
#define _RXF5EIDL_RXF5EID5_POSITION                         0x5
#define _RXF5EIDL_RXF5EID5_SIZE                             0x1
#define _RXF5EIDL_RXF5EID5_LENGTH                           0x1
#define _RXF5EIDL_RXF5EID5_MASK                             0x20
#define _RXF5EIDL_RXF5EID6_POSN                             0x6
#define _RXF5EIDL_RXF5EID6_POSITION                         0x6
#define _RXF5EIDL_RXF5EID6_SIZE                             0x1
#define _RXF5EIDL_RXF5EID6_LENGTH                           0x1
#define _RXF5EIDL_RXF5EID6_MASK                             0x40
#define _RXF5EIDL_RXF5EID7_POSN                             0x7
#define _RXF5EIDL_RXF5EID7_POSITION                         0x7
#define _RXF5EIDL_RXF5EID7_SIZE                             0x1
#define _RXF5EIDL_RXF5EID7_LENGTH                           0x1
#define _RXF5EIDL_RXF5EID7_MASK                             0x80

// Register: RXM0SIDH
#define RXM0SIDH RXM0SIDH
extern volatile unsigned char           RXM0SIDH            __at(0xEF8);
#ifndef _LIB_BUILD
asm("RXM0SIDH equ 0EF8h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SID                    :8;
    };
    struct {
        unsigned SID3                   :1;
        unsigned SID4                   :1;
        unsigned SID5                   :1;
        unsigned SID6                   :1;
        unsigned SID7                   :1;
        unsigned SID8                   :1;
        unsigned SID9                   :1;
        unsigned SID10                  :1;
    };
    struct {
        unsigned RXM0SID3               :1;
        unsigned RXM0SID4               :1;
        unsigned RXM0SID5               :1;
        unsigned RXM0SID6               :1;
        unsigned RXM0SID7               :1;
        unsigned RXM0SID8               :1;
        unsigned RXM0SID9               :1;
        unsigned RXM0SID10              :1;
    };
} RXM0SIDHbits_t;
extern volatile RXM0SIDHbits_t RXM0SIDHbits __at(0xEF8);
// bitfield macros
#define _RXM0SIDH_SID_POSN                                  0x0
#define _RXM0SIDH_SID_POSITION                              0x0
#define _RXM0SIDH_SID_SIZE                                  0x8
#define _RXM0SIDH_SID_LENGTH                                0x8
#define _RXM0SIDH_SID_MASK                                  0xFF
#define _RXM0SIDH_SID3_POSN                                 0x0
#define _RXM0SIDH_SID3_POSITION                             0x0
#define _RXM0SIDH_SID3_SIZE                                 0x1
#define _RXM0SIDH_SID3_LENGTH                               0x1
#define _RXM0SIDH_SID3_MASK                                 0x1
#define _RXM0SIDH_SID4_POSN                                 0x1
#define _RXM0SIDH_SID4_POSITION                             0x1
#define _RXM0SIDH_SID4_SIZE                                 0x1
#define _RXM0SIDH_SID4_LENGTH                               0x1
#define _RXM0SIDH_SID4_MASK                                 0x2
#define _RXM0SIDH_SID5_POSN                                 0x2
#define _RXM0SIDH_SID5_POSITION                             0x2
#define _RXM0SIDH_SID5_SIZE                                 0x1
#define _RXM0SIDH_SID5_LENGTH                               0x1
#define _RXM0SIDH_SID5_MASK                                 0x4
#define _RXM0SIDH_SID6_POSN                                 0x3
#define _RXM0SIDH_SID6_POSITION                             0x3
#define _RXM0SIDH_SID6_SIZE                                 0x1
#define _RXM0SIDH_SID6_LENGTH                               0x1
#define _RXM0SIDH_SID6_MASK                                 0x8
#define _RXM0SIDH_SID7_POSN                                 0x4
#define _RXM0SIDH_SID7_POSITION                             0x4
#define _RXM0SIDH_SID7_SIZE                                 0x1
#define _RXM0SIDH_SID7_LENGTH                               0x1
#define _RXM0SIDH_SID7_MASK                                 0x10
#define _RXM0SIDH_SID8_POSN                                 0x5
#define _RXM0SIDH_SID8_POSITION                             0x5
#define _RXM0SIDH_SID8_SIZE                                 0x1
#define _RXM0SIDH_SID8_LENGTH                               0x1
#define _RXM0SIDH_SID8_MASK                                 0x20
#define _RXM0SIDH_SID9_POSN                                 0x6
#define _RXM0SIDH_SID9_POSITION                             0x6
#define _RXM0SIDH_SID9_SIZE                                 0x1
#define _RXM0SIDH_SID9_LENGTH                               0x1
#define _RXM0SIDH_SID9_MASK                                 0x40
#define _RXM0SIDH_SID10_POSN                                0x7
#define _RXM0SIDH_SID10_POSITION                            0x7
#define _RXM0SIDH_SID10_SIZE                                0x1
#define _RXM0SIDH_SID10_LENGTH                              0x1
#define _RXM0SIDH_SID10_MASK                                0x80
#define _RXM0SIDH_RXM0SID3_POSN                             0x0
#define _RXM0SIDH_RXM0SID3_POSITION                         0x0
#define _RXM0SIDH_RXM0SID3_SIZE                             0x1
#define _RXM0SIDH_RXM0SID3_LENGTH                           0x1
#define _RXM0SIDH_RXM0SID3_MASK                             0x1
#define _RXM0SIDH_RXM0SID4_POSN                             0x1
#define _RXM0SIDH_RXM0SID4_POSITION                         0x1
#define _RXM0SIDH_RXM0SID4_SIZE                             0x1
#define _RXM0SIDH_RXM0SID4_LENGTH                           0x1
#define _RXM0SIDH_RXM0SID4_MASK                             0x2
#define _RXM0SIDH_RXM0SID5_POSN                             0x2
#define _RXM0SIDH_RXM0SID5_POSITION                         0x2
#define _RXM0SIDH_RXM0SID5_SIZE                             0x1
#define _RXM0SIDH_RXM0SID5_LENGTH                           0x1
#define _RXM0SIDH_RXM0SID5_MASK                             0x4
#define _RXM0SIDH_RXM0SID6_POSN                             0x3
#define _RXM0SIDH_RXM0SID6_POSITION                         0x3
#define _RXM0SIDH_RXM0SID6_SIZE                             0x1
#define _RXM0SIDH_RXM0SID6_LENGTH                           0x1
#define _RXM0SIDH_RXM0SID6_MASK                             0x8
#define _RXM0SIDH_RXM0SID7_POSN                             0x4
#define _RXM0SIDH_RXM0SID7_POSITION                         0x4
#define _RXM0SIDH_RXM0SID7_SIZE                             0x1
#define _RXM0SIDH_RXM0SID7_LENGTH                           0x1
#define _RXM0SIDH_RXM0SID7_MASK                             0x10
#define _RXM0SIDH_RXM0SID8_POSN                             0x5
#define _RXM0SIDH_RXM0SID8_POSITION                         0x5
#define _RXM0SIDH_RXM0SID8_SIZE                             0x1
#define _RXM0SIDH_RXM0SID8_LENGTH                           0x1
#define _RXM0SIDH_RXM0SID8_MASK                             0x20
#define _RXM0SIDH_RXM0SID9_POSN                             0x6
#define _RXM0SIDH_RXM0SID9_POSITION                         0x6
#define _RXM0SIDH_RXM0SID9_SIZE                             0x1
#define _RXM0SIDH_RXM0SID9_LENGTH                           0x1
#define _RXM0SIDH_RXM0SID9_MASK                             0x40
#define _RXM0SIDH_RXM0SID10_POSN                            0x7
#define _RXM0SIDH_RXM0SID10_POSITION                        0x7
#define _RXM0SIDH_RXM0SID10_SIZE                            0x1
#define _RXM0SIDH_RXM0SID10_LENGTH                          0x1
#define _RXM0SIDH_RXM0SID10_MASK                            0x80

// Register: RXM0SIDL
#define RXM0SIDL RXM0SIDL
extern volatile unsigned char           RXM0SIDL            __at(0xEF9);
#ifndef _LIB_BUILD
asm("RXM0SIDL equ 0EF9h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned EID                    :2;
        unsigned                        :1;
        unsigned EXIDEN                 :1;
        unsigned                        :1;
        unsigned SID                    :3;
    };
    struct {
        unsigned EID16                  :1;
        unsigned EID17                  :1;
        unsigned                        :3;
        unsigned SID0                   :1;
        unsigned SID1                   :1;
        unsigned SID2                   :1;
    };
    struct {
        unsigned RXM0EID16              :1;
        unsigned RXM0EID17              :1;
        unsigned                        :1;
        unsigned RXM0EXIDM              :1;
        unsigned                        :1;
        unsigned RXM0SID0               :1;
        unsigned RXM0SID1               :1;
        unsigned RXM0SID2               :1;
    };
} RXM0SIDLbits_t;
