MikroElektronika/core_packages/PIC/XC8/def/PIC18LF26K80/mcu.h
extern volatile RXM0EIDLbits_t RXM0EIDLbits __at(0xEFB);
// bitfield macros
#define _RXM0EIDL_EID_POSN                                  0x0
#define _RXM0EIDL_EID_POSITION                              0x0
#define _RXM0EIDL_EID_SIZE                                  0x8
#define _RXM0EIDL_EID_LENGTH                                0x8
#define _RXM0EIDL_EID_MASK                                  0xFF
#define _RXM0EIDL_EID0_POSN                                 0x0
#define _RXM0EIDL_EID0_POSITION                             0x0
#define _RXM0EIDL_EID0_SIZE                                 0x1
#define _RXM0EIDL_EID0_LENGTH                               0x1
#define _RXM0EIDL_EID0_MASK                                 0x1
#define _RXM0EIDL_EID1_POSN                                 0x1
#define _RXM0EIDL_EID1_POSITION                             0x1
#define _RXM0EIDL_EID1_SIZE                                 0x1
#define _RXM0EIDL_EID1_LENGTH                               0x1
#define _RXM0EIDL_EID1_MASK                                 0x2
#define _RXM0EIDL_EID2_POSN                                 0x2
#define _RXM0EIDL_EID2_POSITION                             0x2
#define _RXM0EIDL_EID2_SIZE                                 0x1
#define _RXM0EIDL_EID2_LENGTH                               0x1
#define _RXM0EIDL_EID2_MASK                                 0x4
#define _RXM0EIDL_EID3_POSN                                 0x3
#define _RXM0EIDL_EID3_POSITION                             0x3
#define _RXM0EIDL_EID3_SIZE                                 0x1
#define _RXM0EIDL_EID3_LENGTH                               0x1
#define _RXM0EIDL_EID3_MASK                                 0x8
#define _RXM0EIDL_EID4_POSN                                 0x4
#define _RXM0EIDL_EID4_POSITION                             0x4
#define _RXM0EIDL_EID4_SIZE                                 0x1
#define _RXM0EIDL_EID4_LENGTH                               0x1
#define _RXM0EIDL_EID4_MASK                                 0x10
#define _RXM0EIDL_EID5_POSN                                 0x5
#define _RXM0EIDL_EID5_POSITION                             0x5
#define _RXM0EIDL_EID5_SIZE                                 0x1
#define _RXM0EIDL_EID5_LENGTH                               0x1
#define _RXM0EIDL_EID5_MASK                                 0x20
#define _RXM0EIDL_EID6_POSN                                 0x6
#define _RXM0EIDL_EID6_POSITION                             0x6
#define _RXM0EIDL_EID6_SIZE                                 0x1
#define _RXM0EIDL_EID6_LENGTH                               0x1
#define _RXM0EIDL_EID6_MASK                                 0x40
#define _RXM0EIDL_EID7_POSN                                 0x7
#define _RXM0EIDL_EID7_POSITION                             0x7
#define _RXM0EIDL_EID7_SIZE                                 0x1
#define _RXM0EIDL_EID7_LENGTH                               0x1
#define _RXM0EIDL_EID7_MASK                                 0x80
#define _RXM0EIDL_RXM0EID0_POSN                             0x0
#define _RXM0EIDL_RXM0EID0_POSITION                         0x0
#define _RXM0EIDL_RXM0EID0_SIZE                             0x1
#define _RXM0EIDL_RXM0EID0_LENGTH                           0x1
#define _RXM0EIDL_RXM0EID0_MASK                             0x1
#define _RXM0EIDL_RXM0EID1_POSN                             0x1
#define _RXM0EIDL_RXM0EID1_POSITION                         0x1
#define _RXM0EIDL_RXM0EID1_SIZE                             0x1
#define _RXM0EIDL_RXM0EID1_LENGTH                           0x1
#define _RXM0EIDL_RXM0EID1_MASK                             0x2
#define _RXM0EIDL_RXM0EID2_POSN                             0x2
#define _RXM0EIDL_RXM0EID2_POSITION                         0x2
#define _RXM0EIDL_RXM0EID2_SIZE                             0x1
#define _RXM0EIDL_RXM0EID2_LENGTH                           0x1
#define _RXM0EIDL_RXM0EID2_MASK                             0x4
#define _RXM0EIDL_RXM0EID3_POSN                             0x3
#define _RXM0EIDL_RXM0EID3_POSITION                         0x3
#define _RXM0EIDL_RXM0EID3_SIZE                             0x1
#define _RXM0EIDL_RXM0EID3_LENGTH                           0x1
#define _RXM0EIDL_RXM0EID3_MASK                             0x8
#define _RXM0EIDL_RXM0EID4_POSN                             0x4
#define _RXM0EIDL_RXM0EID4_POSITION                         0x4
#define _RXM0EIDL_RXM0EID4_SIZE                             0x1
#define _RXM0EIDL_RXM0EID4_LENGTH                           0x1
#define _RXM0EIDL_RXM0EID4_MASK                             0x10
#define _RXM0EIDL_RXM0EID5_POSN                             0x5
#define _RXM0EIDL_RXM0EID5_POSITION                         0x5
#define _RXM0EIDL_RXM0EID5_SIZE                             0x1
#define _RXM0EIDL_RXM0EID5_LENGTH                           0x1
#define _RXM0EIDL_RXM0EID5_MASK                             0x20
#define _RXM0EIDL_RXM0EID6_POSN                             0x6
#define _RXM0EIDL_RXM0EID6_POSITION                         0x6
#define _RXM0EIDL_RXM0EID6_SIZE                             0x1
#define _RXM0EIDL_RXM0EID6_LENGTH                           0x1
#define _RXM0EIDL_RXM0EID6_MASK                             0x40
#define _RXM0EIDL_RXM0EID7_POSN                             0x7
#define _RXM0EIDL_RXM0EID7_POSITION                         0x7
#define _RXM0EIDL_RXM0EID7_SIZE                             0x1
#define _RXM0EIDL_RXM0EID7_LENGTH                           0x1
#define _RXM0EIDL_RXM0EID7_MASK                             0x80

// Register: RXM1SIDH
#define RXM1SIDH RXM1SIDH
extern volatile unsigned char           RXM1SIDH            __at(0xEFC);
#ifndef _LIB_BUILD
asm("RXM1SIDH equ 0EFCh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SID                    :8;
    };
    struct {
        unsigned SID3                   :1;
        unsigned SID4                   :1;
        unsigned SID5                   :1;
        unsigned SID6                   :1;
        unsigned SID7                   :1;
        unsigned SID8                   :1;
        unsigned SID9                   :1;
        unsigned SID10                  :1;
    };
    struct {
        unsigned RXM1SID3               :1;
        unsigned RXM1SID4               :1;
        unsigned RXM1SID5               :1;
        unsigned RXM1SID6               :1;
        unsigned RXM1SID7               :1;
        unsigned RXM1SID8               :1;
        unsigned RXM1SID9               :1;
        unsigned RXM1SID10              :1;
    };
} RXM1SIDHbits_t;
