MikroElektronika/core_packages/PIC/XC8/def/PIC18LF26K80/mcu.h
extern volatile TXB2EIDLbits_t TXB2EIDLbits __at(0xF04);
// bitfield macros
#define _TXB2EIDL_EID_POSN                                  0x0
#define _TXB2EIDL_EID_POSITION                              0x0
#define _TXB2EIDL_EID_SIZE                                  0x8
#define _TXB2EIDL_EID_LENGTH                                0x8
#define _TXB2EIDL_EID_MASK                                  0xFF
#define _TXB2EIDL_EID0_POSN                                 0x0
#define _TXB2EIDL_EID0_POSITION                             0x0
#define _TXB2EIDL_EID0_SIZE                                 0x1
#define _TXB2EIDL_EID0_LENGTH                               0x1
#define _TXB2EIDL_EID0_MASK                                 0x1
#define _TXB2EIDL_EID1_POSN                                 0x1
#define _TXB2EIDL_EID1_POSITION                             0x1
#define _TXB2EIDL_EID1_SIZE                                 0x1
#define _TXB2EIDL_EID1_LENGTH                               0x1
#define _TXB2EIDL_EID1_MASK                                 0x2
#define _TXB2EIDL_EID2_POSN                                 0x2
#define _TXB2EIDL_EID2_POSITION                             0x2
#define _TXB2EIDL_EID2_SIZE                                 0x1
#define _TXB2EIDL_EID2_LENGTH                               0x1
#define _TXB2EIDL_EID2_MASK                                 0x4
#define _TXB2EIDL_EID3_POSN                                 0x3
#define _TXB2EIDL_EID3_POSITION                             0x3
#define _TXB2EIDL_EID3_SIZE                                 0x1
#define _TXB2EIDL_EID3_LENGTH                               0x1
#define _TXB2EIDL_EID3_MASK                                 0x8
#define _TXB2EIDL_EID4_POSN                                 0x4
#define _TXB2EIDL_EID4_POSITION                             0x4
#define _TXB2EIDL_EID4_SIZE                                 0x1
#define _TXB2EIDL_EID4_LENGTH                               0x1
#define _TXB2EIDL_EID4_MASK                                 0x10
#define _TXB2EIDL_EID5_POSN                                 0x5
#define _TXB2EIDL_EID5_POSITION                             0x5
#define _TXB2EIDL_EID5_SIZE                                 0x1
#define _TXB2EIDL_EID5_LENGTH                               0x1
#define _TXB2EIDL_EID5_MASK                                 0x20
#define _TXB2EIDL_EID6_POSN                                 0x6
#define _TXB2EIDL_EID6_POSITION                             0x6
#define _TXB2EIDL_EID6_SIZE                                 0x1
#define _TXB2EIDL_EID6_LENGTH                               0x1
#define _TXB2EIDL_EID6_MASK                                 0x40
#define _TXB2EIDL_EID7_POSN                                 0x7
#define _TXB2EIDL_EID7_POSITION                             0x7
#define _TXB2EIDL_EID7_SIZE                                 0x1
#define _TXB2EIDL_EID7_LENGTH                               0x1
#define _TXB2EIDL_EID7_MASK                                 0x80
#define _TXB2EIDL_TXB2EID0_POSN                             0x0
#define _TXB2EIDL_TXB2EID0_POSITION                         0x0
#define _TXB2EIDL_TXB2EID0_SIZE                             0x1
#define _TXB2EIDL_TXB2EID0_LENGTH                           0x1
#define _TXB2EIDL_TXB2EID0_MASK                             0x1
#define _TXB2EIDL_TXB2EID1_POSN                             0x1
#define _TXB2EIDL_TXB2EID1_POSITION                         0x1
#define _TXB2EIDL_TXB2EID1_SIZE                             0x1
#define _TXB2EIDL_TXB2EID1_LENGTH                           0x1
#define _TXB2EIDL_TXB2EID1_MASK                             0x2
#define _TXB2EIDL_TXB2EID2_POSN                             0x2
#define _TXB2EIDL_TXB2EID2_POSITION                         0x2
#define _TXB2EIDL_TXB2EID2_SIZE                             0x1
#define _TXB2EIDL_TXB2EID2_LENGTH                           0x1
#define _TXB2EIDL_TXB2EID2_MASK                             0x4
#define _TXB2EIDL_TXB2EID3_POSN                             0x3
#define _TXB2EIDL_TXB2EID3_POSITION                         0x3
#define _TXB2EIDL_TXB2EID3_SIZE                             0x1
#define _TXB2EIDL_TXB2EID3_LENGTH                           0x1
#define _TXB2EIDL_TXB2EID3_MASK                             0x8
#define _TXB2EIDL_TXB2EID4_POSN                             0x4
#define _TXB2EIDL_TXB2EID4_POSITION                         0x4
#define _TXB2EIDL_TXB2EID4_SIZE                             0x1
#define _TXB2EIDL_TXB2EID4_LENGTH                           0x1
#define _TXB2EIDL_TXB2EID4_MASK                             0x10
#define _TXB2EIDL_TXB2EID5_POSN                             0x5
#define _TXB2EIDL_TXB2EID5_POSITION                         0x5
#define _TXB2EIDL_TXB2EID5_SIZE                             0x1
#define _TXB2EIDL_TXB2EID5_LENGTH                           0x1
#define _TXB2EIDL_TXB2EID5_MASK                             0x20
#define _TXB2EIDL_TXB2EID6_POSN                             0x6
#define _TXB2EIDL_TXB2EID6_POSITION                         0x6
#define _TXB2EIDL_TXB2EID6_SIZE                             0x1
#define _TXB2EIDL_TXB2EID6_LENGTH                           0x1
#define _TXB2EIDL_TXB2EID6_MASK                             0x40
#define _TXB2EIDL_TXB2EID7_POSN                             0x7
#define _TXB2EIDL_TXB2EID7_POSITION                         0x7
#define _TXB2EIDL_TXB2EID7_SIZE                             0x1
#define _TXB2EIDL_TXB2EID7_LENGTH                           0x1
#define _TXB2EIDL_TXB2EID7_MASK                             0x80

// Register: TXB2DLC
#define TXB2DLC TXB2DLC
extern volatile unsigned char           TXB2DLC             __at(0xF05);
#ifndef _LIB_BUILD
asm("TXB2DLC equ 0F05h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DLC                    :4;
        unsigned                        :2;
        unsigned TXRTR                  :1;
    };
    struct {
        unsigned DLC0                   :1;
        unsigned DLC1                   :1;
        unsigned DLC2                   :1;
        unsigned DLC3                   :1;
    };
    struct {
        unsigned TXB2DLC0               :1;
        unsigned TXB2DLC1               :1;
        unsigned TXB2DLC2               :1;
        unsigned TXB2DLC3               :1;
        unsigned                        :2;
        unsigned TXB2RTR                :1;
    };
} TXB2DLCbits_t;
extern volatile TXB2DLCbits_t TXB2DLCbits __at(0xF05);
// bitfield macros
#define _TXB2DLC_DLC_POSN                                   0x0
#define _TXB2DLC_DLC_POSITION                               0x0
#define _TXB2DLC_DLC_SIZE                                   0x4
#define _TXB2DLC_DLC_LENGTH                                 0x4
#define _TXB2DLC_DLC_MASK                                   0xF
#define _TXB2DLC_TXRTR_POSN                                 0x6
#define _TXB2DLC_TXRTR_POSITION                             0x6
#define _TXB2DLC_TXRTR_SIZE                                 0x1
#define _TXB2DLC_TXRTR_LENGTH                               0x1
#define _TXB2DLC_TXRTR_MASK                                 0x40
#define _TXB2DLC_DLC0_POSN                                  0x0
#define _TXB2DLC_DLC0_POSITION                              0x0
#define _TXB2DLC_DLC0_SIZE                                  0x1
#define _TXB2DLC_DLC0_LENGTH                                0x1
#define _TXB2DLC_DLC0_MASK                                  0x1
#define _TXB2DLC_DLC1_POSN                                  0x1
#define _TXB2DLC_DLC1_POSITION                              0x1
#define _TXB2DLC_DLC1_SIZE                                  0x1
#define _TXB2DLC_DLC1_LENGTH                                0x1
#define _TXB2DLC_DLC1_MASK                                  0x2
#define _TXB2DLC_DLC2_POSN                                  0x2
#define _TXB2DLC_DLC2_POSITION                              0x2
#define _TXB2DLC_DLC2_SIZE                                  0x1
#define _TXB2DLC_DLC2_LENGTH                                0x1
#define _TXB2DLC_DLC2_MASK                                  0x4
#define _TXB2DLC_DLC3_POSN                                  0x3
#define _TXB2DLC_DLC3_POSITION                              0x3
#define _TXB2DLC_DLC3_SIZE                                  0x1
#define _TXB2DLC_DLC3_LENGTH                                0x1
#define _TXB2DLC_DLC3_MASK                                  0x8
#define _TXB2DLC_TXB2DLC0_POSN                              0x0
#define _TXB2DLC_TXB2DLC0_POSITION                          0x0
#define _TXB2DLC_TXB2DLC0_SIZE                              0x1
#define _TXB2DLC_TXB2DLC0_LENGTH                            0x1
#define _TXB2DLC_TXB2DLC0_MASK                              0x1
#define _TXB2DLC_TXB2DLC1_POSN                              0x1
#define _TXB2DLC_TXB2DLC1_POSITION                          0x1
#define _TXB2DLC_TXB2DLC1_SIZE                              0x1
#define _TXB2DLC_TXB2DLC1_LENGTH                            0x1
#define _TXB2DLC_TXB2DLC1_MASK                              0x2
#define _TXB2DLC_TXB2DLC2_POSN                              0x2
#define _TXB2DLC_TXB2DLC2_POSITION                          0x2
#define _TXB2DLC_TXB2DLC2_SIZE                              0x1
#define _TXB2DLC_TXB2DLC2_LENGTH                            0x1
#define _TXB2DLC_TXB2DLC2_MASK                              0x4
#define _TXB2DLC_TXB2DLC3_POSN                              0x3
#define _TXB2DLC_TXB2DLC3_POSITION                          0x3
#define _TXB2DLC_TXB2DLC3_SIZE                              0x1
#define _TXB2DLC_TXB2DLC3_LENGTH                            0x1
#define _TXB2DLC_TXB2DLC3_MASK                              0x8
#define _TXB2DLC_TXB2RTR_POSN                               0x6
#define _TXB2DLC_TXB2RTR_POSITION                           0x6
#define _TXB2DLC_TXB2RTR_SIZE                               0x1
#define _TXB2DLC_TXB2RTR_LENGTH                             0x1
#define _TXB2DLC_TXB2RTR_MASK                               0x40

// Register: TXB2D0
#define TXB2D0 TXB2D0
extern volatile unsigned char           TXB2D0              __at(0xF06);
#ifndef _LIB_BUILD
asm("TXB2D0 equ 0F06h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TXB2D0                 :8;
    };
    struct {
        unsigned TXB2D00                :1;
        unsigned TXB2D01                :1;
        unsigned TXB2D02                :1;
        unsigned TXB2D03                :1;
        unsigned TXB2D04                :1;
        unsigned TXB2D05                :1;
        unsigned TXB2D06                :1;
        unsigned TXB2D07                :1;
    };
} TXB2D0bits_t;
extern volatile TXB2D0bits_t TXB2D0bits __at(0xF06);
// bitfield macros
#define _TXB2D0_TXB2D0_POSN                                 0x0
#define _TXB2D0_TXB2D0_POSITION                             0x0
#define _TXB2D0_TXB2D0_SIZE                                 0x8
#define _TXB2D0_TXB2D0_LENGTH                               0x8
#define _TXB2D0_TXB2D0_MASK                                 0xFF
#define _TXB2D0_TXB2D00_POSN                                0x0
#define _TXB2D0_TXB2D00_POSITION                            0x0
#define _TXB2D0_TXB2D00_SIZE                                0x1
#define _TXB2D0_TXB2D00_LENGTH                              0x1
#define _TXB2D0_TXB2D00_MASK                                0x1
#define _TXB2D0_TXB2D01_POSN                                0x1
#define _TXB2D0_TXB2D01_POSITION                            0x1
#define _TXB2D0_TXB2D01_SIZE                                0x1
#define _TXB2D0_TXB2D01_LENGTH                              0x1
#define _TXB2D0_TXB2D01_MASK                                0x2
#define _TXB2D0_TXB2D02_POSN                                0x2
#define _TXB2D0_TXB2D02_POSITION                            0x2
#define _TXB2D0_TXB2D02_SIZE                                0x1
#define _TXB2D0_TXB2D02_LENGTH                              0x1
#define _TXB2D0_TXB2D02_MASK                                0x4
#define _TXB2D0_TXB2D03_POSN                                0x3
#define _TXB2D0_TXB2D03_POSITION                            0x3
#define _TXB2D0_TXB2D03_SIZE                                0x1
#define _TXB2D0_TXB2D03_LENGTH                              0x1
#define _TXB2D0_TXB2D03_MASK                                0x8
#define _TXB2D0_TXB2D04_POSN                                0x4
#define _TXB2D0_TXB2D04_POSITION                            0x4
#define _TXB2D0_TXB2D04_SIZE                                0x1
#define _TXB2D0_TXB2D04_LENGTH                              0x1
#define _TXB2D0_TXB2D04_MASK                                0x10
#define _TXB2D0_TXB2D05_POSN                                0x5
#define _TXB2D0_TXB2D05_POSITION                            0x5
#define _TXB2D0_TXB2D05_SIZE                                0x1
#define _TXB2D0_TXB2D05_LENGTH                              0x1
#define _TXB2D0_TXB2D05_MASK                                0x20
#define _TXB2D0_TXB2D06_POSN                                0x6
#define _TXB2D0_TXB2D06_POSITION                            0x6
#define _TXB2D0_TXB2D06_SIZE                                0x1
#define _TXB2D0_TXB2D06_LENGTH                              0x1
#define _TXB2D0_TXB2D06_MASK                                0x40
#define _TXB2D0_TXB2D07_POSN                                0x7
#define _TXB2D0_TXB2D07_POSITION                            0x7
#define _TXB2D0_TXB2D07_SIZE                                0x1
#define _TXB2D0_TXB2D07_LENGTH                              0x1
#define _TXB2D0_TXB2D07_MASK                                0x80

