MikroElektronika/core_packages/PIC/XC8/def/PIC18LF26K80/mcu.h
// Register: TXB2D3
#define TXB2D3 TXB2D3
extern volatile unsigned char           TXB2D3              __at(0xF09);
#ifndef _LIB_BUILD
asm("TXB2D3 equ 0F09h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TXB2D3                 :8;
    };
    struct {
        unsigned TXB2D30                :1;
        unsigned TXB2D31                :1;
        unsigned TXB2D32                :1;
        unsigned TXB2D33                :1;
        unsigned TXB2D34                :1;
        unsigned TXB2D35                :1;
        unsigned TXB2D36                :1;
        unsigned TXB2D37                :1;
    };
} TXB2D3bits_t;
extern volatile TXB2D3bits_t TXB2D3bits __at(0xF09);
// bitfield macros
#define _TXB2D3_TXB2D3_POSN                                 0x0
#define _TXB2D3_TXB2D3_POSITION                             0x0
#define _TXB2D3_TXB2D3_SIZE                                 0x8
#define _TXB2D3_TXB2D3_LENGTH                               0x8
#define _TXB2D3_TXB2D3_MASK                                 0xFF
#define _TXB2D3_TXB2D30_POSN                                0x0
#define _TXB2D3_TXB2D30_POSITION                            0x0
#define _TXB2D3_TXB2D30_SIZE                                0x1
#define _TXB2D3_TXB2D30_LENGTH                              0x1
#define _TXB2D3_TXB2D30_MASK                                0x1
#define _TXB2D3_TXB2D31_POSN                                0x1
#define _TXB2D3_TXB2D31_POSITION                            0x1
#define _TXB2D3_TXB2D31_SIZE                                0x1
#define _TXB2D3_TXB2D31_LENGTH                              0x1
#define _TXB2D3_TXB2D31_MASK                                0x2
#define _TXB2D3_TXB2D32_POSN                                0x2
#define _TXB2D3_TXB2D32_POSITION                            0x2
#define _TXB2D3_TXB2D32_SIZE                                0x1
#define _TXB2D3_TXB2D32_LENGTH                              0x1
#define _TXB2D3_TXB2D32_MASK                                0x4
#define _TXB2D3_TXB2D33_POSN                                0x3
#define _TXB2D3_TXB2D33_POSITION                            0x3
#define _TXB2D3_TXB2D33_SIZE                                0x1
#define _TXB2D3_TXB2D33_LENGTH                              0x1
#define _TXB2D3_TXB2D33_MASK                                0x8
#define _TXB2D3_TXB2D34_POSN                                0x4
#define _TXB2D3_TXB2D34_POSITION                            0x4
#define _TXB2D3_TXB2D34_SIZE                                0x1
#define _TXB2D3_TXB2D34_LENGTH                              0x1
#define _TXB2D3_TXB2D34_MASK                                0x10
#define _TXB2D3_TXB2D35_POSN                                0x5
#define _TXB2D3_TXB2D35_POSITION                            0x5
#define _TXB2D3_TXB2D35_SIZE                                0x1
#define _TXB2D3_TXB2D35_LENGTH                              0x1
#define _TXB2D3_TXB2D35_MASK                                0x20
#define _TXB2D3_TXB2D36_POSN                                0x6
#define _TXB2D3_TXB2D36_POSITION                            0x6
#define _TXB2D3_TXB2D36_SIZE                                0x1
#define _TXB2D3_TXB2D36_LENGTH                              0x1
#define _TXB2D3_TXB2D36_MASK                                0x40
#define _TXB2D3_TXB2D37_POSN                                0x7
#define _TXB2D3_TXB2D37_POSITION                            0x7
#define _TXB2D3_TXB2D37_SIZE                                0x1
#define _TXB2D3_TXB2D37_LENGTH                              0x1
#define _TXB2D3_TXB2D37_MASK                                0x80

// Register: TXB2D4
#define TXB2D4 TXB2D4
extern volatile unsigned char           TXB2D4              __at(0xF0A);
#ifndef _LIB_BUILD
asm("TXB2D4 equ 0F0Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TXB2D4                 :8;
    };
    struct {
        unsigned TXB2D40                :1;
        unsigned TXB2D41                :1;
        unsigned TXB2D42                :1;
        unsigned TXB2D43                :1;
        unsigned TXB2D44                :1;
        unsigned TXB2D45                :1;
        unsigned TXB2D46                :1;
        unsigned TXB2D47                :1;
    };
} TXB2D4bits_t;
extern volatile TXB2D4bits_t TXB2D4bits __at(0xF0A);
// bitfield macros
#define _TXB2D4_TXB2D4_POSN                                 0x0
#define _TXB2D4_TXB2D4_POSITION                             0x0
#define _TXB2D4_TXB2D4_SIZE                                 0x8
#define _TXB2D4_TXB2D4_LENGTH                               0x8
#define _TXB2D4_TXB2D4_MASK                                 0xFF
#define _TXB2D4_TXB2D40_POSN                                0x0
#define _TXB2D4_TXB2D40_POSITION                            0x0
#define _TXB2D4_TXB2D40_SIZE                                0x1
#define _TXB2D4_TXB2D40_LENGTH                              0x1
#define _TXB2D4_TXB2D40_MASK                                0x1
#define _TXB2D4_TXB2D41_POSN                                0x1
#define _TXB2D4_TXB2D41_POSITION                            0x1
#define _TXB2D4_TXB2D41_SIZE                                0x1
#define _TXB2D4_TXB2D41_LENGTH                              0x1
#define _TXB2D4_TXB2D41_MASK                                0x2
#define _TXB2D4_TXB2D42_POSN                                0x2
#define _TXB2D4_TXB2D42_POSITION                            0x2
#define _TXB2D4_TXB2D42_SIZE                                0x1
#define _TXB2D4_TXB2D42_LENGTH                              0x1
#define _TXB2D4_TXB2D42_MASK                                0x4
#define _TXB2D4_TXB2D43_POSN                                0x3
#define _TXB2D4_TXB2D43_POSITION                            0x3
#define _TXB2D4_TXB2D43_SIZE                                0x1
#define _TXB2D4_TXB2D43_LENGTH                              0x1
#define _TXB2D4_TXB2D43_MASK                                0x8
#define _TXB2D4_TXB2D44_POSN                                0x4
#define _TXB2D4_TXB2D44_POSITION                            0x4
#define _TXB2D4_TXB2D44_SIZE                                0x1
#define _TXB2D4_TXB2D44_LENGTH                              0x1
#define _TXB2D4_TXB2D44_MASK                                0x10
#define _TXB2D4_TXB2D45_POSN                                0x5
#define _TXB2D4_TXB2D45_POSITION                            0x5
#define _TXB2D4_TXB2D45_SIZE                                0x1
#define _TXB2D4_TXB2D45_LENGTH                              0x1
#define _TXB2D4_TXB2D45_MASK                                0x20
#define _TXB2D4_TXB2D46_POSN                                0x6
#define _TXB2D4_TXB2D46_POSITION                            0x6
#define _TXB2D4_TXB2D46_SIZE                                0x1
#define _TXB2D4_TXB2D46_LENGTH                              0x1
#define _TXB2D4_TXB2D46_MASK                                0x40
#define _TXB2D4_TXB2D47_POSN                                0x7
#define _TXB2D4_TXB2D47_POSITION                            0x7
#define _TXB2D4_TXB2D47_SIZE                                0x1
#define _TXB2D4_TXB2D47_LENGTH                              0x1
#define _TXB2D4_TXB2D47_MASK                                0x80

// Register: TXB2D5
#define TXB2D5 TXB2D5
extern volatile unsigned char           TXB2D5              __at(0xF0B);
#ifndef _LIB_BUILD
asm("TXB2D5 equ 0F0Bh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TXB2D5                 :8;
    };
    struct {
        unsigned TXB2D50                :1;
        unsigned TXB2D51                :1;
        unsigned TXB2D52                :1;
        unsigned TXB2D53                :1;
        unsigned TXB2D54                :1;
        unsigned TXB2D55                :1;
        unsigned TXB2D56                :1;
        unsigned TXB2D57                :1;
    };
} TXB2D5bits_t;
