MikroElektronika/core_packages/PIC/XC8/def/PIC18LF26K80/mcu.h
// Register: RXB0D3
#define RXB0D3 RXB0D3
extern volatile unsigned char           RXB0D3              __at(0xF69);
#ifndef _LIB_BUILD
asm("RXB0D3 equ 0F69h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RXB0D3                 :8;
    };
    struct {
        unsigned RXB0D30                :1;
        unsigned RXB0D31                :1;
        unsigned RXB0D32                :1;
        unsigned RXB0D33                :1;
        unsigned RXB0D34                :1;
        unsigned RXB0D35                :1;
        unsigned RXB0D36                :1;
        unsigned RXB0D37                :1;
    };
} RXB0D3bits_t;
extern volatile RXB0D3bits_t RXB0D3bits __at(0xF69);
// bitfield macros
#define _RXB0D3_RXB0D3_POSN                                 0x0
#define _RXB0D3_RXB0D3_POSITION                             0x0
#define _RXB0D3_RXB0D3_SIZE                                 0x8
#define _RXB0D3_RXB0D3_LENGTH                               0x8
#define _RXB0D3_RXB0D3_MASK                                 0xFF
#define _RXB0D3_RXB0D30_POSN                                0x0
#define _RXB0D3_RXB0D30_POSITION                            0x0
#define _RXB0D3_RXB0D30_SIZE                                0x1
#define _RXB0D3_RXB0D30_LENGTH                              0x1
#define _RXB0D3_RXB0D30_MASK                                0x1
#define _RXB0D3_RXB0D31_POSN                                0x1
#define _RXB0D3_RXB0D31_POSITION                            0x1
#define _RXB0D3_RXB0D31_SIZE                                0x1
#define _RXB0D3_RXB0D31_LENGTH                              0x1
#define _RXB0D3_RXB0D31_MASK                                0x2
#define _RXB0D3_RXB0D32_POSN                                0x2
#define _RXB0D3_RXB0D32_POSITION                            0x2
#define _RXB0D3_RXB0D32_SIZE                                0x1
#define _RXB0D3_RXB0D32_LENGTH                              0x1
#define _RXB0D3_RXB0D32_MASK                                0x4
#define _RXB0D3_RXB0D33_POSN                                0x3
#define _RXB0D3_RXB0D33_POSITION                            0x3
#define _RXB0D3_RXB0D33_SIZE                                0x1
#define _RXB0D3_RXB0D33_LENGTH                              0x1
#define _RXB0D3_RXB0D33_MASK                                0x8
#define _RXB0D3_RXB0D34_POSN                                0x4
#define _RXB0D3_RXB0D34_POSITION                            0x4
#define _RXB0D3_RXB0D34_SIZE                                0x1
#define _RXB0D3_RXB0D34_LENGTH                              0x1
#define _RXB0D3_RXB0D34_MASK                                0x10
#define _RXB0D3_RXB0D35_POSN                                0x5
#define _RXB0D3_RXB0D35_POSITION                            0x5
#define _RXB0D3_RXB0D35_SIZE                                0x1
#define _RXB0D3_RXB0D35_LENGTH                              0x1
#define _RXB0D3_RXB0D35_MASK                                0x20
#define _RXB0D3_RXB0D36_POSN                                0x6
#define _RXB0D3_RXB0D36_POSITION                            0x6
#define _RXB0D3_RXB0D36_SIZE                                0x1
#define _RXB0D3_RXB0D36_LENGTH                              0x1
#define _RXB0D3_RXB0D36_MASK                                0x40
#define _RXB0D3_RXB0D37_POSN                                0x7
#define _RXB0D3_RXB0D37_POSITION                            0x7
#define _RXB0D3_RXB0D37_SIZE                                0x1
#define _RXB0D3_RXB0D37_LENGTH                              0x1
#define _RXB0D3_RXB0D37_MASK                                0x80

// Register: RXB0D4
#define RXB0D4 RXB0D4
extern volatile unsigned char           RXB0D4              __at(0xF6A);
#ifndef _LIB_BUILD
asm("RXB0D4 equ 0F6Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RXB0D4                 :8;
    };
    struct {
        unsigned RXB0D40                :1;
        unsigned RXB0D41                :1;
        unsigned RXB0D42                :1;
        unsigned RXB0D43                :1;
        unsigned RXB0D44                :1;
        unsigned RXB0D45                :1;
        unsigned RXB0D46                :1;
        unsigned RXB0D47                :1;
    };
} RXB0D4bits_t;
extern volatile RXB0D4bits_t RXB0D4bits __at(0xF6A);
// bitfield macros
#define _RXB0D4_RXB0D4_POSN                                 0x0
#define _RXB0D4_RXB0D4_POSITION                             0x0
#define _RXB0D4_RXB0D4_SIZE                                 0x8
#define _RXB0D4_RXB0D4_LENGTH                               0x8
#define _RXB0D4_RXB0D4_MASK                                 0xFF
#define _RXB0D4_RXB0D40_POSN                                0x0
#define _RXB0D4_RXB0D40_POSITION                            0x0
#define _RXB0D4_RXB0D40_SIZE                                0x1
#define _RXB0D4_RXB0D40_LENGTH                              0x1
#define _RXB0D4_RXB0D40_MASK                                0x1
#define _RXB0D4_RXB0D41_POSN                                0x1
#define _RXB0D4_RXB0D41_POSITION                            0x1
#define _RXB0D4_RXB0D41_SIZE                                0x1
#define _RXB0D4_RXB0D41_LENGTH                              0x1
#define _RXB0D4_RXB0D41_MASK                                0x2
#define _RXB0D4_RXB0D42_POSN                                0x2
#define _RXB0D4_RXB0D42_POSITION                            0x2
#define _RXB0D4_RXB0D42_SIZE                                0x1
#define _RXB0D4_RXB0D42_LENGTH                              0x1
#define _RXB0D4_RXB0D42_MASK                                0x4
#define _RXB0D4_RXB0D43_POSN                                0x3
#define _RXB0D4_RXB0D43_POSITION                            0x3
#define _RXB0D4_RXB0D43_SIZE                                0x1
#define _RXB0D4_RXB0D43_LENGTH                              0x1
#define _RXB0D4_RXB0D43_MASK                                0x8
#define _RXB0D4_RXB0D44_POSN                                0x4
#define _RXB0D4_RXB0D44_POSITION                            0x4
#define _RXB0D4_RXB0D44_SIZE                                0x1
#define _RXB0D4_RXB0D44_LENGTH                              0x1
#define _RXB0D4_RXB0D44_MASK                                0x10
#define _RXB0D4_RXB0D45_POSN                                0x5
#define _RXB0D4_RXB0D45_POSITION                            0x5
#define _RXB0D4_RXB0D45_SIZE                                0x1
#define _RXB0D4_RXB0D45_LENGTH                              0x1
#define _RXB0D4_RXB0D45_MASK                                0x20
#define _RXB0D4_RXB0D46_POSN                                0x6
#define _RXB0D4_RXB0D46_POSITION                            0x6
#define _RXB0D4_RXB0D46_SIZE                                0x1
#define _RXB0D4_RXB0D46_LENGTH                              0x1
#define _RXB0D4_RXB0D46_MASK                                0x40
#define _RXB0D4_RXB0D47_POSN                                0x7
#define _RXB0D4_RXB0D47_POSITION                            0x7
#define _RXB0D4_RXB0D47_SIZE                                0x1
#define _RXB0D4_RXB0D47_LENGTH                              0x1
#define _RXB0D4_RXB0D47_MASK                                0x80

// Register: RXB0D5
#define RXB0D5 RXB0D5
extern volatile unsigned char           RXB0D5              __at(0xF6B);
#ifndef _LIB_BUILD
asm("RXB0D5 equ 0F6Bh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RXB0D5                 :8;
    };
    struct {
        unsigned RXB0D50                :1;
        unsigned RXB0D51                :1;
        unsigned RXB0D52                :1;
        unsigned RXB0D53                :1;
        unsigned RXB0D54                :1;
        unsigned RXB0D55                :1;
        unsigned RXB0D56                :1;
        unsigned RXB0D57                :1;
    };
} RXB0D5bits_t;
