MikroElektronika/core_packages/PIC/XC8/def/PIC18LF26K80/mcu.h
extern volatile RXB0D5bits_t RXB0D5bits __at(0xF6B);
// bitfield macros
#define _RXB0D5_RXB0D5_POSN                                 0x0
#define _RXB0D5_RXB0D5_POSITION                             0x0
#define _RXB0D5_RXB0D5_SIZE                                 0x8
#define _RXB0D5_RXB0D5_LENGTH                               0x8
#define _RXB0D5_RXB0D5_MASK                                 0xFF
#define _RXB0D5_RXB0D50_POSN                                0x0
#define _RXB0D5_RXB0D50_POSITION                            0x0
#define _RXB0D5_RXB0D50_SIZE                                0x1
#define _RXB0D5_RXB0D50_LENGTH                              0x1
#define _RXB0D5_RXB0D50_MASK                                0x1
#define _RXB0D5_RXB0D51_POSN                                0x1
#define _RXB0D5_RXB0D51_POSITION                            0x1
#define _RXB0D5_RXB0D51_SIZE                                0x1
#define _RXB0D5_RXB0D51_LENGTH                              0x1
#define _RXB0D5_RXB0D51_MASK                                0x2
#define _RXB0D5_RXB0D52_POSN                                0x2
#define _RXB0D5_RXB0D52_POSITION                            0x2
#define _RXB0D5_RXB0D52_SIZE                                0x1
#define _RXB0D5_RXB0D52_LENGTH                              0x1
#define _RXB0D5_RXB0D52_MASK                                0x4
#define _RXB0D5_RXB0D53_POSN                                0x3
#define _RXB0D5_RXB0D53_POSITION                            0x3
#define _RXB0D5_RXB0D53_SIZE                                0x1
#define _RXB0D5_RXB0D53_LENGTH                              0x1
#define _RXB0D5_RXB0D53_MASK                                0x8
#define _RXB0D5_RXB0D54_POSN                                0x4
#define _RXB0D5_RXB0D54_POSITION                            0x4
#define _RXB0D5_RXB0D54_SIZE                                0x1
#define _RXB0D5_RXB0D54_LENGTH                              0x1
#define _RXB0D5_RXB0D54_MASK                                0x10
#define _RXB0D5_RXB0D55_POSN                                0x5
#define _RXB0D5_RXB0D55_POSITION                            0x5
#define _RXB0D5_RXB0D55_SIZE                                0x1
#define _RXB0D5_RXB0D55_LENGTH                              0x1
#define _RXB0D5_RXB0D55_MASK                                0x20
#define _RXB0D5_RXB0D56_POSN                                0x6
#define _RXB0D5_RXB0D56_POSITION                            0x6
#define _RXB0D5_RXB0D56_SIZE                                0x1
#define _RXB0D5_RXB0D56_LENGTH                              0x1
#define _RXB0D5_RXB0D56_MASK                                0x40
#define _RXB0D5_RXB0D57_POSN                                0x7
#define _RXB0D5_RXB0D57_POSITION                            0x7
#define _RXB0D5_RXB0D57_SIZE                                0x1
#define _RXB0D5_RXB0D57_LENGTH                              0x1
#define _RXB0D5_RXB0D57_MASK                                0x80

// Register: RXB0D6
#define RXB0D6 RXB0D6
extern volatile unsigned char           RXB0D6              __at(0xF6C);
#ifndef _LIB_BUILD
asm("RXB0D6 equ 0F6Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RXB0D6                 :8;
    };
    struct {
        unsigned RXB0D60                :1;
        unsigned RXB0D61                :1;
        unsigned RXB0D62                :1;
        unsigned RXB0D63                :1;
        unsigned RXB0D64                :1;
        unsigned RXB0D65                :1;
        unsigned RXB0D66                :1;
        unsigned RXB0D67                :1;
    };
} RXB0D6bits_t;
extern volatile RXB0D6bits_t RXB0D6bits __at(0xF6C);
// bitfield macros
#define _RXB0D6_RXB0D6_POSN                                 0x0
#define _RXB0D6_RXB0D6_POSITION                             0x0
#define _RXB0D6_RXB0D6_SIZE                                 0x8
#define _RXB0D6_RXB0D6_LENGTH                               0x8
#define _RXB0D6_RXB0D6_MASK                                 0xFF
#define _RXB0D6_RXB0D60_POSN                                0x0
#define _RXB0D6_RXB0D60_POSITION                            0x0
#define _RXB0D6_RXB0D60_SIZE                                0x1
#define _RXB0D6_RXB0D60_LENGTH                              0x1
#define _RXB0D6_RXB0D60_MASK                                0x1
#define _RXB0D6_RXB0D61_POSN                                0x1
#define _RXB0D6_RXB0D61_POSITION                            0x1
#define _RXB0D6_RXB0D61_SIZE                                0x1
#define _RXB0D6_RXB0D61_LENGTH                              0x1
#define _RXB0D6_RXB0D61_MASK                                0x2
#define _RXB0D6_RXB0D62_POSN                                0x2
#define _RXB0D6_RXB0D62_POSITION                            0x2
#define _RXB0D6_RXB0D62_SIZE                                0x1
#define _RXB0D6_RXB0D62_LENGTH                              0x1
#define _RXB0D6_RXB0D62_MASK                                0x4
#define _RXB0D6_RXB0D63_POSN                                0x3
#define _RXB0D6_RXB0D63_POSITION                            0x3
#define _RXB0D6_RXB0D63_SIZE                                0x1
#define _RXB0D6_RXB0D63_LENGTH                              0x1
#define _RXB0D6_RXB0D63_MASK                                0x8
#define _RXB0D6_RXB0D64_POSN                                0x4
#define _RXB0D6_RXB0D64_POSITION                            0x4
#define _RXB0D6_RXB0D64_SIZE                                0x1
#define _RXB0D6_RXB0D64_LENGTH                              0x1
#define _RXB0D6_RXB0D64_MASK                                0x10
#define _RXB0D6_RXB0D65_POSN                                0x5
#define _RXB0D6_RXB0D65_POSITION                            0x5
#define _RXB0D6_RXB0D65_SIZE                                0x1
#define _RXB0D6_RXB0D65_LENGTH                              0x1
#define _RXB0D6_RXB0D65_MASK                                0x20
#define _RXB0D6_RXB0D66_POSN                                0x6
#define _RXB0D6_RXB0D66_POSITION                            0x6
#define _RXB0D6_RXB0D66_SIZE                                0x1
#define _RXB0D6_RXB0D66_LENGTH                              0x1
#define _RXB0D6_RXB0D66_MASK                                0x40
#define _RXB0D6_RXB0D67_POSN                                0x7
#define _RXB0D6_RXB0D67_POSITION                            0x7
#define _RXB0D6_RXB0D67_SIZE                                0x1
#define _RXB0D6_RXB0D67_LENGTH                              0x1
#define _RXB0D6_RXB0D67_MASK                                0x80

// Register: RXB0D7
#define RXB0D7 RXB0D7
extern volatile unsigned char           RXB0D7              __at(0xF6D);
#ifndef _LIB_BUILD
asm("RXB0D7 equ 0F6Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RXB0D7                 :8;
    };
    struct {
        unsigned RXB0D70                :1;
        unsigned RXB0D71                :1;
        unsigned RXB0D72                :1;
        unsigned RXB0D73                :1;
        unsigned RXB0D74                :1;
        unsigned RXB0D75                :1;
        unsigned RXB0D76                :1;
        unsigned RXB0D77                :1;
    };
} RXB0D7bits_t;
extern volatile RXB0D7bits_t RXB0D7bits __at(0xF6D);
// bitfield macros
#define _RXB0D7_RXB0D7_POSN                                 0x0
#define _RXB0D7_RXB0D7_POSITION                             0x0
#define _RXB0D7_RXB0D7_SIZE                                 0x8
#define _RXB0D7_RXB0D7_LENGTH                               0x8
#define _RXB0D7_RXB0D7_MASK                                 0xFF
#define _RXB0D7_RXB0D70_POSN                                0x0
#define _RXB0D7_RXB0D70_POSITION                            0x0
#define _RXB0D7_RXB0D70_SIZE                                0x1
#define _RXB0D7_RXB0D70_LENGTH                              0x1
#define _RXB0D7_RXB0D70_MASK                                0x1
#define _RXB0D7_RXB0D71_POSN                                0x1
#define _RXB0D7_RXB0D71_POSITION                            0x1
#define _RXB0D7_RXB0D71_SIZE                                0x1
#define _RXB0D7_RXB0D71_LENGTH                              0x1
#define _RXB0D7_RXB0D71_MASK                                0x2
#define _RXB0D7_RXB0D72_POSN                                0x2
#define _RXB0D7_RXB0D72_POSITION                            0x2
#define _RXB0D7_RXB0D72_SIZE                                0x1
#define _RXB0D7_RXB0D72_LENGTH                              0x1
#define _RXB0D7_RXB0D72_MASK                                0x4
#define _RXB0D7_RXB0D73_POSN                                0x3
#define _RXB0D7_RXB0D73_POSITION                            0x3
#define _RXB0D7_RXB0D73_SIZE                                0x1
#define _RXB0D7_RXB0D73_LENGTH                              0x1
#define _RXB0D7_RXB0D73_MASK                                0x8
#define _RXB0D7_RXB0D74_POSN                                0x4
#define _RXB0D7_RXB0D74_POSITION                            0x4
#define _RXB0D7_RXB0D74_SIZE                                0x1
#define _RXB0D7_RXB0D74_LENGTH                              0x1
#define _RXB0D7_RXB0D74_MASK                                0x10
#define _RXB0D7_RXB0D75_POSN                                0x5
#define _RXB0D7_RXB0D75_POSITION                            0x5
#define _RXB0D7_RXB0D75_SIZE                                0x1
#define _RXB0D7_RXB0D75_LENGTH                              0x1
#define _RXB0D7_RXB0D75_MASK                                0x20
#define _RXB0D7_RXB0D76_POSN                                0x6
#define _RXB0D7_RXB0D76_POSITION                            0x6
#define _RXB0D7_RXB0D76_SIZE                                0x1
#define _RXB0D7_RXB0D76_LENGTH                              0x1
#define _RXB0D7_RXB0D76_MASK                                0x40
#define _RXB0D7_RXB0D77_POSN                                0x7
#define _RXB0D7_RXB0D77_POSITION                            0x7
#define _RXB0D7_RXB0D77_SIZE                                0x1
#define _RXB0D7_RXB0D77_LENGTH                              0x1
#define _RXB0D7_RXB0D77_MASK                                0x80

// Register: CANSTAT
#define CANSTAT CANSTAT
extern volatile unsigned char           CANSTAT             __at(0xF6E);
#ifndef _LIB_BUILD
asm("CANSTAT equ 0F6Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned EICODE0                :1;
        unsigned EICODE1_ICODE0         :1;
        unsigned EICODE2_ICODE1         :1;
        unsigned EICODE3_ICODE2         :1;
        unsigned EICODE4                :1;
        unsigned OPMODE                 :3;
    };
    struct {
        unsigned                        :1;
        unsigned EICODE1                :1;
        unsigned EICODE2                :1;
        unsigned EICODE3                :1;
        unsigned                        :1;
        unsigned OPMODE0                :1;
        unsigned OPMODE1                :1;
        unsigned OPMODE2                :1;
    };
    struct {
        unsigned                        :1;
        unsigned ICODE0                 :1;
        unsigned ICODE1                 :1;
        unsigned ICODE2                 :1;
    };
} CANSTATbits_t;
