MikroElektronika/core_packages/PIC/XC8/def/PIC18LF26K80/mcu.h
// Register: PIR5
#define PIR5 PIR5
extern volatile unsigned char           PIR5                __at(0xF77);
#ifndef _LIB_BUILD
asm("PIR5 equ 0F77h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RXB0IF                 :1;
        unsigned RXB1IF                 :1;
        unsigned TXB0IF                 :1;
        unsigned TXB1IF                 :1;
        unsigned TXB2IF                 :1;
        unsigned ERRIF                  :1;
        unsigned WAKIF                  :1;
        unsigned IRXIF                  :1;
    };
    struct {
        unsigned FIFOWMIF               :1;
        unsigned RXBnIF                 :1;
        unsigned                        :2;
        unsigned TXBnIF                 :1;
    };
} PIR5bits_t;
extern volatile PIR5bits_t PIR5bits __at(0xF77);
// bitfield macros
#define _PIR5_RXB0IF_POSN                                   0x0
#define _PIR5_RXB0IF_POSITION                               0x0
#define _PIR5_RXB0IF_SIZE                                   0x1
#define _PIR5_RXB0IF_LENGTH                                 0x1
#define _PIR5_RXB0IF_MASK                                   0x1
#define _PIR5_RXB1IF_POSN                                   0x1
#define _PIR5_RXB1IF_POSITION                               0x1
#define _PIR5_RXB1IF_SIZE                                   0x1
#define _PIR5_RXB1IF_LENGTH                                 0x1
#define _PIR5_RXB1IF_MASK                                   0x2
#define _PIR5_TXB0IF_POSN                                   0x2
#define _PIR5_TXB0IF_POSITION                               0x2
#define _PIR5_TXB0IF_SIZE                                   0x1
#define _PIR5_TXB0IF_LENGTH                                 0x1
#define _PIR5_TXB0IF_MASK                                   0x4
#define _PIR5_TXB1IF_POSN                                   0x3
#define _PIR5_TXB1IF_POSITION                               0x3
#define _PIR5_TXB1IF_SIZE                                   0x1
#define _PIR5_TXB1IF_LENGTH                                 0x1
#define _PIR5_TXB1IF_MASK                                   0x8
#define _PIR5_TXB2IF_POSN                                   0x4
#define _PIR5_TXB2IF_POSITION                               0x4
#define _PIR5_TXB2IF_SIZE                                   0x1
#define _PIR5_TXB2IF_LENGTH                                 0x1
#define _PIR5_TXB2IF_MASK                                   0x10
#define _PIR5_ERRIF_POSN                                    0x5
#define _PIR5_ERRIF_POSITION                                0x5
#define _PIR5_ERRIF_SIZE                                    0x1
#define _PIR5_ERRIF_LENGTH                                  0x1
#define _PIR5_ERRIF_MASK                                    0x20
#define _PIR5_WAKIF_POSN                                    0x6
#define _PIR5_WAKIF_POSITION                                0x6
#define _PIR5_WAKIF_SIZE                                    0x1
#define _PIR5_WAKIF_LENGTH                                  0x1
#define _PIR5_WAKIF_MASK                                    0x40
#define _PIR5_IRXIF_POSN                                    0x7
#define _PIR5_IRXIF_POSITION                                0x7
#define _PIR5_IRXIF_SIZE                                    0x1
#define _PIR5_IRXIF_LENGTH                                  0x1
#define _PIR5_IRXIF_MASK                                    0x80
#define _PIR5_FIFOWMIF_POSN                                 0x0
#define _PIR5_FIFOWMIF_POSITION                             0x0
#define _PIR5_FIFOWMIF_SIZE                                 0x1
#define _PIR5_FIFOWMIF_LENGTH                               0x1
#define _PIR5_FIFOWMIF_MASK                                 0x1
#define _PIR5_RXBnIF_POSN                                   0x1
#define _PIR5_RXBnIF_POSITION                               0x1
#define _PIR5_RXBnIF_SIZE                                   0x1
#define _PIR5_RXBnIF_LENGTH                                 0x1
#define _PIR5_RXBnIF_MASK                                   0x2
#define _PIR5_TXBnIF_POSN                                   0x4
#define _PIR5_TXBnIF_POSITION                               0x4
#define _PIR5_TXBnIF_SIZE                                   0x1
#define _PIR5_TXBnIF_LENGTH                                 0x1
#define _PIR5_TXBnIF_MASK                                   0x10

// Register: IPR5
#define IPR5 IPR5
extern volatile unsigned char           IPR5                __at(0xF78);
#ifndef _LIB_BUILD
asm("IPR5 equ 0F78h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RXB0IP                 :1;
        unsigned RXB1IP                 :1;
        unsigned TXB0IP                 :1;
        unsigned TXB1IP                 :1;
        unsigned TXB2IP                 :1;
        unsigned ERRIP                  :1;
        unsigned WAKIP                  :1;
        unsigned IRXIP                  :1;
    };
    struct {
        unsigned FIFOWMIP               :1;
        unsigned RXBnIP                 :1;
        unsigned                        :2;
        unsigned TXBnIP                 :1;
    };
    struct {
        unsigned CCH05                  :1;
        unsigned CCH15                  :1;
        unsigned                        :1;
        unsigned EVPOL05                :1;
        unsigned EVPOL15                :1;
    };
} IPR5bits_t;
extern volatile IPR5bits_t IPR5bits __at(0xF78);
// bitfield macros
#define _IPR5_RXB0IP_POSN                                   0x0
#define _IPR5_RXB0IP_POSITION                               0x0
#define _IPR5_RXB0IP_SIZE                                   0x1
#define _IPR5_RXB0IP_LENGTH                                 0x1
#define _IPR5_RXB0IP_MASK                                   0x1
#define _IPR5_RXB1IP_POSN                                   0x1
#define _IPR5_RXB1IP_POSITION                               0x1
#define _IPR5_RXB1IP_SIZE                                   0x1
#define _IPR5_RXB1IP_LENGTH                                 0x1
#define _IPR5_RXB1IP_MASK                                   0x2
#define _IPR5_TXB0IP_POSN                                   0x2
#define _IPR5_TXB0IP_POSITION                               0x2
#define _IPR5_TXB0IP_SIZE                                   0x1
#define _IPR5_TXB0IP_LENGTH                                 0x1
#define _IPR5_TXB0IP_MASK                                   0x4
#define _IPR5_TXB1IP_POSN                                   0x3
#define _IPR5_TXB1IP_POSITION                               0x3
#define _IPR5_TXB1IP_SIZE                                   0x1
#define _IPR5_TXB1IP_LENGTH                                 0x1
#define _IPR5_TXB1IP_MASK                                   0x8
#define _IPR5_TXB2IP_POSN                                   0x4
#define _IPR5_TXB2IP_POSITION                               0x4
#define _IPR5_TXB2IP_SIZE                                   0x1
#define _IPR5_TXB2IP_LENGTH                                 0x1
#define _IPR5_TXB2IP_MASK                                   0x10
#define _IPR5_ERRIP_POSN                                    0x5
#define _IPR5_ERRIP_POSITION                                0x5
#define _IPR5_ERRIP_SIZE                                    0x1
#define _IPR5_ERRIP_LENGTH                                  0x1
#define _IPR5_ERRIP_MASK                                    0x20
#define _IPR5_WAKIP_POSN                                    0x6
#define _IPR5_WAKIP_POSITION                                0x6
#define _IPR5_WAKIP_SIZE                                    0x1
#define _IPR5_WAKIP_LENGTH                                  0x1
#define _IPR5_WAKIP_MASK                                    0x40
#define _IPR5_IRXIP_POSN                                    0x7
#define _IPR5_IRXIP_POSITION                                0x7
#define _IPR5_IRXIP_SIZE                                    0x1
#define _IPR5_IRXIP_LENGTH                                  0x1
#define _IPR5_IRXIP_MASK                                    0x80
#define _IPR5_FIFOWMIP_POSN                                 0x0
#define _IPR5_FIFOWMIP_POSITION                             0x0
#define _IPR5_FIFOWMIP_SIZE                                 0x1
#define _IPR5_FIFOWMIP_LENGTH                               0x1
#define _IPR5_FIFOWMIP_MASK                                 0x1
#define _IPR5_RXBnIP_POSN                                   0x1
#define _IPR5_RXBnIP_POSITION                               0x1
#define _IPR5_RXBnIP_SIZE                                   0x1
#define _IPR5_RXBnIP_LENGTH                                 0x1
#define _IPR5_RXBnIP_MASK                                   0x2
#define _IPR5_TXBnIP_POSN                                   0x4
#define _IPR5_TXBnIP_POSITION                               0x4
#define _IPR5_TXBnIP_SIZE                                   0x1
#define _IPR5_TXBnIP_LENGTH                                 0x1
#define _IPR5_TXBnIP_MASK                                   0x10
#define _IPR5_CCH05_POSN                                    0x0
#define _IPR5_CCH05_POSITION                                0x0
#define _IPR5_CCH05_SIZE                                    0x1
#define _IPR5_CCH05_LENGTH                                  0x1
#define _IPR5_CCH05_MASK                                    0x1
#define _IPR5_CCH15_POSN                                    0x1
#define _IPR5_CCH15_POSITION                                0x1
#define _IPR5_CCH15_SIZE                                    0x1
#define _IPR5_CCH15_LENGTH                                  0x1
#define _IPR5_CCH15_MASK                                    0x2
#define _IPR5_EVPOL05_POSN                                  0x3
#define _IPR5_EVPOL05_POSITION                              0x3
#define _IPR5_EVPOL05_SIZE                                  0x1
#define _IPR5_EVPOL05_LENGTH                                0x1
#define _IPR5_EVPOL05_MASK                                  0x8
#define _IPR5_EVPOL15_POSN                                  0x4
#define _IPR5_EVPOL15_POSITION                              0x4
#define _IPR5_EVPOL15_SIZE                                  0x1
#define _IPR5_EVPOL15_LENGTH                                0x1
#define _IPR5_EVPOL15_MASK                                  0x10

// Register: TXREG2
#define TXREG2 TXREG2
extern volatile unsigned char           TXREG2              __at(0xF79);
#ifndef _LIB_BUILD
asm("TXREG2 equ 0F79h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TXREG2                 :8;
    };
} TXREG2bits_t;
extern volatile TXREG2bits_t TXREG2bits __at(0xF79);
// bitfield macros
#define _TXREG2_TXREG2_POSN                                 0x0
#define _TXREG2_TXREG2_POSITION                             0x0
#define _TXREG2_TXREG2_SIZE                                 0x8
#define _TXREG2_TXREG2_LENGTH                               0x8
#define _TXREG2_TXREG2_MASK                                 0xFF

// Register: RCREG2
#define RCREG2 RCREG2
extern volatile unsigned char           RCREG2              __at(0xF7A);
#ifndef _LIB_BUILD
asm("RCREG2 equ 0F7Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RCREG2                 :8;
    };
} RCREG2bits_t;
extern volatile RCREG2bits_t RCREG2bits __at(0xF7A);
// bitfield macros
#define _RCREG2_RCREG2_POSN                                 0x0
#define _RCREG2_RCREG2_POSITION                             0x0
#define _RCREG2_RCREG2_SIZE                                 0x8
#define _RCREG2_RCREG2_LENGTH                               0x8
#define _RCREG2_RCREG2_MASK                                 0xFF

