MikroElektronika/core_packages/PIC/XC8/def/PIC18LF26K80/mcu.h
extern volatile __bit                   TXB2EID8            __at(0x7818);	// @ (0xF03 * 8 + 0)
#define                                 TXB2EID8_bit        _BIT_ACCESS(TXB2EIDH,0)
// TXB2EIDH<TXB2EID9>
extern volatile __bit                   TXB2EID9            __at(0x7819);	// @ (0xF03 * 8 + 1)
#define                                 TXB2EID9_bit        _BIT_ACCESS(TXB2EIDH,1)
// TXB2CON<TXB2ERR>
extern volatile __bit                   TXB2ERR             __at(0x7804);	// @ (0xF00 * 8 + 4)
#define                                 TXB2ERR_bit         _BIT_ACCESS(TXB2CON,4)
// TXB2SIDL<TXB2EXIDE>
extern volatile __bit                   TXB2EXIDE           __at(0x7813);	// @ (0xF02 * 8 + 3)
#define                                 TXB2EXIDE_bit       _BIT_ACCESS(TXB2SIDL,3)
// PIR5<TXB2IF>
extern volatile __bit                   TXB2IF              __at(0x7BBC);	// @ (0xF77 * 8 + 4)
#define                                 TXB2IF_bit          _BIT_ACCESS(PIR5,4)
// IPR5<TXB2IP>
extern volatile __bit                   TXB2IP              __at(0x7BC4);	// @ (0xF78 * 8 + 4)
#define                                 TXB2IP_bit          _BIT_ACCESS(IPR5,4)
// TXB2CON<TXB2LARB>
extern volatile __bit                   TXB2LARB            __at(0x7805);	// @ (0xF00 * 8 + 5)
#define                                 TXB2LARB_bit        _BIT_ACCESS(TXB2CON,5)
// TXB2CON<TXB2PRI0>
extern volatile __bit                   TXB2PRI0            __at(0x7800);	// @ (0xF00 * 8 + 0)
#define                                 TXB2PRI0_bit        _BIT_ACCESS(TXB2CON,0)
// TXB2CON<TXB2PRI1>
extern volatile __bit                   TXB2PRI1            __at(0x7801);	// @ (0xF00 * 8 + 1)
#define                                 TXB2PRI1_bit        _BIT_ACCESS(TXB2CON,1)
// TXB2CON<TXB2REQ>
extern volatile __bit                   TXB2REQ             __at(0x7803);	// @ (0xF00 * 8 + 3)
#define                                 TXB2REQ_bit         _BIT_ACCESS(TXB2CON,3)
// TXB2DLC<TXB2RTR>
extern volatile __bit                   TXB2RTR             __at(0x782E);	// @ (0xF05 * 8 + 6)
#define                                 TXB2RTR_bit         _BIT_ACCESS(TXB2DLC,6)
// TXB2SIDL<TXB2SID0>
extern volatile __bit                   TXB2SID0            __at(0x7815);	// @ (0xF02 * 8 + 5)
#define                                 TXB2SID0_bit        _BIT_ACCESS(TXB2SIDL,5)
// TXB2SIDL<TXB2SID1>
extern volatile __bit                   TXB2SID1            __at(0x7816);	// @ (0xF02 * 8 + 6)
#define                                 TXB2SID1_bit        _BIT_ACCESS(TXB2SIDL,6)
// TXB2SIDH<TXB2SID10>
extern volatile __bit                   TXB2SID10           __at(0x780F);	// @ (0xF01 * 8 + 7)
#define                                 TXB2SID10_bit       _BIT_ACCESS(TXB2SIDH,7)
// TXB2SIDL<TXB2SID2>
extern volatile __bit                   TXB2SID2            __at(0x7817);	// @ (0xF02 * 8 + 7)
#define                                 TXB2SID2_bit        _BIT_ACCESS(TXB2SIDL,7)
// TXB2SIDH<TXB2SID3>
extern volatile __bit                   TXB2SID3            __at(0x7808);	// @ (0xF01 * 8 + 0)
#define                                 TXB2SID3_bit        _BIT_ACCESS(TXB2SIDH,0)
// TXB2SIDH<TXB2SID4>
extern volatile __bit                   TXB2SID4            __at(0x7809);	// @ (0xF01 * 8 + 1)
#define                                 TXB2SID4_bit        _BIT_ACCESS(TXB2SIDH,1)
// TXB2SIDH<TXB2SID5>
extern volatile __bit                   TXB2SID5            __at(0x780A);	// @ (0xF01 * 8 + 2)
#define                                 TXB2SID5_bit        _BIT_ACCESS(TXB2SIDH,2)
// TXB2SIDH<TXB2SID6>
extern volatile __bit                   TXB2SID6            __at(0x780B);	// @ (0xF01 * 8 + 3)
#define                                 TXB2SID6_bit        _BIT_ACCESS(TXB2SIDH,3)
// TXB2SIDH<TXB2SID7>
extern volatile __bit                   TXB2SID7            __at(0x780C);	// @ (0xF01 * 8 + 4)
#define                                 TXB2SID7_bit        _BIT_ACCESS(TXB2SIDH,4)
// TXB2SIDH<TXB2SID8>
extern volatile __bit                   TXB2SID8            __at(0x780D);	// @ (0xF01 * 8 + 5)
#define                                 TXB2SID8_bit        _BIT_ACCESS(TXB2SIDH,5)
// TXB2SIDH<TXB2SID9>
extern volatile __bit                   TXB2SID9            __at(0x780E);	// @ (0xF01 * 8 + 6)
#define                                 TXB2SID9_bit        _BIT_ACCESS(TXB2SIDH,6)
// PIE3<TXBNIE>
extern volatile __bit                   TXBNIE              __at(0x7D1C);	// @ (0xFA3 * 8 + 4)
#define                                 TXBNIE_bit          _BIT_ACCESS(PIE3,4)
// PIR3<TXBNIF>
extern volatile __bit                   TXBNIF              __at(0x7D24);	// @ (0xFA4 * 8 + 4)
#define                                 TXBNIF_bit          _BIT_ACCESS(PIR3,4)
// IPR3<TXBNIP>
extern volatile __bit                   TXBNIP              __at(0x7D2C);	// @ (0xFA5 * 8 + 4)
#define                                 TXBNIP_bit          _BIT_ACCESS(IPR3,4)
// COMSTAT<TXBO>
extern volatile __bit                   TXBO                __at(0x7B8D);	// @ (0xF71 * 8 + 5)
#define                                 TXBO_bit            _BIT_ACCESS(COMSTAT,5)
// COMSTAT<TXBP>
extern volatile __bit                   TXBP                __at(0x7B8C);	// @ (0xF71 * 8 + 4)
#define                                 TXBP_bit            _BIT_ACCESS(COMSTAT,4)
// PIE5<TXBnIE>
extern volatile __bit                   TXBnIE              __at(0x7BB4);	// @ (0xF76 * 8 + 4)
#define                                 TXBnIE_bit          _BIT_ACCESS(PIE5,4)
// PIR5<TXBnIF>
extern volatile __bit                   TXBnIF              __at(0x7BBC);	// @ (0xF77 * 8 + 4)
#define                                 TXBnIF_bit          _BIT_ACCESS(PIR5,4)
// IPR5<TXBnIP>
extern volatile __bit                   TXBnIP              __at(0x7BC4);	// @ (0xF78 * 8 + 4)
#define                                 TXBnIP_bit          _BIT_ACCESS(IPR5,4)
// BAUDCON1<TXCKP1>
extern volatile __bit                   TXCKP1              __at(0x7D3C);	// @ (0xFA7 * 8 + 4)
#define                                 TXCKP1_bit          _BIT_ACCESS(BAUDCON1,4)
// BAUDCON2<TXCKP2>
extern volatile __bit                   TXCKP2              __at(0x7DCC);	// @ (0xFB9 * 8 + 4)
#define                                 TXCKP2_bit          _BIT_ACCESS(BAUDCON2,4)
// TXSTA1<TXD8>
extern volatile __bit                   TXD8                __at(0x7D60);	// @ (0xFAC * 8 + 0)
#define                                 TXD8_bit            _BIT_ACCESS(TXSTA1,0)
// TXSTA2<TXD82>
extern volatile __bit                   TXD82               __at(0x7DD0);	// @ (0xFBA * 8 + 0)
#define                                 TXD82_bit           _BIT_ACCESS(TXSTA2,0)
// TXSTA1<TXEN1>
extern volatile __bit                   TXEN1               __at(0x7D65);	// @ (0xFAC * 8 + 5)
#define                                 TXEN1_bit           _BIT_ACCESS(TXSTA1,5)
// TXSTA2<TXEN2>
extern volatile __bit                   TXEN2               __at(0x7DD5);	// @ (0xFBA * 8 + 5)
#define                                 TXEN2_bit           _BIT_ACCESS(TXSTA2,5)
// PIE1<TXIE>
extern volatile __bit                   TXIE                __at(0x7CEC);	// @ (0xF9D * 8 + 4)
#define                                 TXIE_bit            _BIT_ACCESS(PIE1,4)
// PIR1<TXIF>
extern volatile __bit                   TXIF                __at(0x7CF4);	// @ (0xF9E * 8 + 4)
#define                                 TXIF_bit            _BIT_ACCESS(PIR1,4)
// IPR1<TXIP>
extern volatile __bit                   TXIP                __at(0x7CFC);	// @ (0xF9F * 8 + 4)
#define                                 TXIP_bit            _BIT_ACCESS(IPR1,4)
// COMSTAT<TXWARN>
extern volatile __bit                   TXWARN              __at(0x7B8A);	// @ (0xF71 * 8 + 2)
#define                                 TXWARN_bit          _BIT_ACCESS(COMSTAT,2)
// ODCON<U1OD>
extern volatile __bit                   U1OD                __at(0x7C88);	// @ (0xF91 * 8 + 0)
#define                                 U1OD_bit            _BIT_ACCESS(ODCON,0)
// ODCON<U2OD>
extern volatile __bit                   U2OD                __at(0x7C89);	// @ (0xF91 * 8 + 1)
#define                                 U2OD_bit            _BIT_ACCESS(ODCON,1)
// SSPSTAT<UA>
extern volatile __bit                   UA                  __at(0x7E39);	// @ (0xFC7 * 8 + 1)
#define                                 UA_bit              _BIT_ACCESS(SSPSTAT,1)
// PMD0<UART1MD>
extern volatile __bit                   UART1MD             __at(0x7AC9);	// @ (0xF59 * 8 + 1)
#define                                 UART1MD_bit         _BIT_ACCESS(PMD0,1)
// PMD0<UART2MD>
extern volatile __bit                   UART2MD             __at(0x7ACA);	// @ (0xF59 * 8 + 2)
#define                                 UART2MD_bit         _BIT_ACCESS(PMD0,2)
// WDTCON<ULPEN>
extern volatile __bit                   ULPEN               __at(0x7E8A);	// @ (0xFD1 * 8 + 2)
#define                                 ULPEN_bit           _BIT_ACCESS(WDTCON,2)
// WDTCON<ULPLVL>
extern volatile __bit                   ULPLVL              __at(0x7E8D);	// @ (0xFD1 * 8 + 5)
#define                                 ULPLVL_bit          _BIT_ACCESS(WDTCON,5)
// WDTCON<ULPSINK>
extern volatile __bit                   ULPSINK             __at(0x7E89);	// @ (0xFD1 * 8 + 1)
#define                                 ULPSINK_bit         _BIT_ACCESS(WDTCON,1)
// PORTA<ULPWUIN>
extern volatile __bit                   ULPWUIN             __at(0x7C00);	// @ (0xF80 * 8 + 0)
#define                                 ULPWUIN_bit         _BIT_ACCESS(PORTA,0)
// ADCON1<VCFG0>
extern volatile __bit                   VCFG0               __at(0x7E0C);	// @ (0xFC1 * 8 + 4)
#define                                 VCFG0_bit           _BIT_ACCESS(ADCON1,4)
// ADCON1<VCFG01>
extern volatile __bit                   VCFG01              __at(0x7E0C);	// @ (0xFC1 * 8 + 4)
#define                                 VCFG01_bit          _BIT_ACCESS(ADCON1,4)
// ADCON1<VCFG1>
extern volatile __bit                   VCFG1               __at(0x7E0D);	// @ (0xFC1 * 8 + 5)
#define                                 VCFG1_bit           _BIT_ACCESS(ADCON1,5)
// ADCON1<VCFG11>
extern volatile __bit                   VCFG11              __at(0x7E0D);	// @ (0xFC1 * 8 + 5)
#define                                 VCFG11_bit          _BIT_ACCESS(ADCON1,5)
// HLVDCON<VDIRMAG>
extern volatile __bit                   VDIRMAG             __at(0x7D47);	// @ (0xFA8 * 8 + 7)
#define                                 VDIRMAG_bit         _BIT_ACCESS(HLVDCON,7)
// ADCON1<VNCFG>
extern volatile __bit                   VNCFG               __at(0x7E0B);	// @ (0xFC1 * 8 + 3)
#define                                 VNCFG_bit           _BIT_ACCESS(ADCON1,3)
// PR2<WAIT0>
extern volatile __bit                   WAIT0               __at(0x7E5C);	// @ (0xFCB * 8 + 4)
#define                                 WAIT0_bit           _BIT_ACCESS(PR2,4)
// PR2<WAIT1>
extern volatile __bit                   WAIT1               __at(0x7E5D);	// @ (0xFCB * 8 + 5)
#define                                 WAIT1_bit           _BIT_ACCESS(PR2,5)
// BRGCON3<WAKDIS>
extern volatile __bit                   WAKDIS              __at(0x722F);	// @ (0xE45 * 8 + 7)
#define                                 WAKDIS_bit          _BIT_ACCESS(BRGCON3,7)
// BRGCON3<WAKFIL>
extern volatile __bit                   WAKFIL              __at(0x722E);	// @ (0xE45 * 8 + 6)
#define                                 WAKFIL_bit          _BIT_ACCESS(BRGCON3,6)
// PIE5<WAKIE>
extern volatile __bit                   WAKIE               __at(0x7BB6);	// @ (0xF76 * 8 + 6)
#define                                 WAKIE_bit           _BIT_ACCESS(PIE5,6)
// PIR5<WAKIF>
extern volatile __bit                   WAKIF               __at(0x7BBE);	// @ (0xF77 * 8 + 6)
#define                                 WAKIF_bit           _BIT_ACCESS(PIR5,6)
// IPR5<WAKIP>
extern volatile __bit                   WAKIP               __at(0x7BC6);	// @ (0xF78 * 8 + 6)
#define                                 WAKIP_bit           _BIT_ACCESS(IPR5,6)
// SSPCON1<WCOL>
extern volatile __bit                   WCOL                __at(0x7E37);	// @ (0xFC6 * 8 + 7)
#define                                 WCOL_bit            _BIT_ACCESS(SSPCON1,7)
// PR2<WM0>
extern volatile __bit                   WM0                 __at(0x7E58);	// @ (0xFCB * 8 + 0)
#define                                 WM0_bit             _BIT_ACCESS(PR2,0)
// PR2<WM1>
extern volatile __bit                   WM1                 __at(0x7E59);	// @ (0xFCB * 8 + 1)
#define                                 WM1_bit             _BIT_ACCESS(PR2,1)
// WPUB<WPUB0>
extern volatile __bit                   WPUB0               __at(0x7AD8);	// @ (0xF5B * 8 + 0)
#define                                 WPUB0_bit           _BIT_ACCESS(WPUB,0)
// WPUB<WPUB1>
extern volatile __bit                   WPUB1               __at(0x7AD9);	// @ (0xF5B * 8 + 1)
#define                                 WPUB1_bit           _BIT_ACCESS(WPUB,1)
// WPUB<WPUB2>
extern volatile __bit                   WPUB2               __at(0x7ADA);	// @ (0xF5B * 8 + 2)
#define                                 WPUB2_bit           _BIT_ACCESS(WPUB,2)
// WPUB<WPUB3>
extern volatile __bit                   WPUB3               __at(0x7ADB);	// @ (0xF5B * 8 + 3)
#define                                 WPUB3_bit           _BIT_ACCESS(WPUB,3)
// WPUB<WPUB4>
extern volatile __bit                   WPUB4               __at(0x7ADC);	// @ (0xF5B * 8 + 4)
#define                                 WPUB4_bit           _BIT_ACCESS(WPUB,4)
// WPUB<WPUB5>
extern volatile __bit                   WPUB5               __at(0x7ADD);	// @ (0xF5B * 8 + 5)
#define                                 WPUB5_bit           _BIT_ACCESS(WPUB,5)
// WPUB<WPUB6>
extern volatile __bit                   WPUB6               __at(0x7ADE);	// @ (0xF5B * 8 + 6)
#define                                 WPUB6_bit           _BIT_ACCESS(WPUB,6)
// WPUB<WPUB7>
extern volatile __bit                   WPUB7               __at(0x7ADF);	// @ (0xF5B * 8 + 7)
#define                                 WPUB7_bit           _BIT_ACCESS(WPUB,7)
// EECON1<WR>
extern volatile __bit                   WR                  __at(0x7BF9);	// @ (0xF7F * 8 + 1)
#define                                 WR_bit              _BIT_ACCESS(EECON1,1)
// EECON1<WREN>
extern volatile __bit                   WREN                __at(0x7BFA);	// @ (0xF7F * 8 + 2)
#define                                 WREN_bit            _BIT_ACCESS(EECON1,2)
// EECON1<WRERR>
extern volatile __bit                   WRERR               __at(0x7BFB);	// @ (0xF7F * 8 + 3)
#define                                 WRERR_bit           _BIT_ACCESS(EECON1,3)
// BAUDCON1<WUE1>
extern volatile __bit                   WUE1                __at(0x7D39);	// @ (0xFA7 * 8 + 1)
#define                                 WUE1_bit            _BIT_ACCESS(BAUDCON1,1)
// BAUDCON2<WUE2>
extern volatile __bit                   WUE2                __at(0x7DC9);	// @ (0xFB9 * 8 + 1)
#define                                 WUE2_bit            _BIT_ACCESS(BAUDCON2,1)
// STATUS<ZERO>
extern volatile __bit                   ZERO                __at(0x7EC2);	// @ (0xFD8 * 8 + 2)
#define                                 ZERO_bit            _BIT_ACCESS(STATUS,2)
// SSPSTAT<nA>
extern volatile __bit                   nA                  __at(0x7E3D);	// @ (0xFC7 * 8 + 5)
#define                                 nA_bit              _BIT_ACCESS(SSPSTAT,5)
// SSPSTAT<nADDRESS>
extern volatile __bit                   nADDRESS            __at(0x7E3D);	// @ (0xFC7 * 8 + 5)
#define                                 nADDRESS_bit        _BIT_ACCESS(SSPSTAT,5)
// RCON<nBOR>
extern volatile __bit                   nBOR                __at(0x7E80);	// @ (0xFD0 * 8 + 0)
#define                                 nBOR_bit            _BIT_ACCESS(RCON,0)
// RCON<nCM>
extern volatile __bit                   nCM                 __at(0x7E85);	// @ (0xFD0 * 8 + 5)
#define                                 nCM_bit             _BIT_ACCESS(RCON,5)
// ADCON0<nDONE>
extern volatile __bit                   nDONE               __at(0x7E11);	// @ (0xFC2 * 8 + 1)
#define                                 nDONE_bit           _BIT_ACCESS(ADCON0,1)
// COMSTAT<nFIFOEMPTY>
extern volatile __bit                   nFIFOEMPTY          __at(0x7B8F);	// @ (0xF71 * 8 + 7)
#define                                 nFIFOEMPTY_bit      _BIT_ACCESS(COMSTAT,7)
// RCON<nPD>
extern volatile __bit                   nPD                 __at(0x7E82);	// @ (0xFD0 * 8 + 2)
#define                                 nPD_bit             _BIT_ACCESS(RCON,2)
// RCON<nPOR>
extern volatile __bit                   nPOR                __at(0x7E81);	// @ (0xFD0 * 8 + 1)
#define                                 nPOR_bit            _BIT_ACCESS(RCON,1)
// INTCON2<nRBPU>
extern volatile __bit                   nRBPU               __at(0x7F8F);	// @ (0xFF1 * 8 + 7)
#define                                 nRBPU_bit           _BIT_ACCESS(INTCON2,7)
// RCSTA1<nRC8>
extern volatile __bit                   nRC8                __at(0x7D5E);	// @ (0xFAB * 8 + 6)
#define                                 nRC8_bit            _BIT_ACCESS(RCSTA1,6)
// RCON<nRI>
extern volatile __bit                   nRI                 __at(0x7E84);	// @ (0xFD0 * 8 + 4)
#define                                 nRI_bit             _BIT_ACCESS(RCON,4)
// T1GCON<nT1DONE>
extern volatile __bit                   nT1DONE             __at(0x7D53);	// @ (0xFAA * 8 + 3)
#define                                 nT1DONE_bit         _BIT_ACCESS(T1GCON,3)
// T1CON<nT1SYNC>
extern volatile __bit                   nT1SYNC             __at(0x7E6A);	// @ (0xFCD * 8 + 2)
#define                                 nT1SYNC_bit         _BIT_ACCESS(T1CON,2)
// T3GCON<nT3DONE>
extern volatile __bit                   nT3DONE             __at(0x7D83);	// @ (0xFB0 * 8 + 3)
#define                                 nT3DONE_bit         _BIT_ACCESS(T3GCON,3)
// T3CON<nT3SYNC>
extern volatile __bit                   nT3SYNC             __at(0x7D8A);	// @ (0xFB1 * 8 + 2)
#define                                 nT3SYNC_bit         _BIT_ACCESS(T3CON,2)
// RCON<nTO>
extern volatile __bit                   nTO                 __at(0x7E83);	// @ (0xFD0 * 8 + 3)
#define                                 nTO_bit             _BIT_ACCESS(RCON,3)
// TXSTA1<nTX8>
extern volatile __bit                   nTX8                __at(0x7D66);	// @ (0xFAC * 8 + 6)
#define                                 nTX8_bit            _BIT_ACCESS(TXSTA1,6)
// SSPSTAT<nW>
extern volatile __bit                   nW                  __at(0x7E3A);	// @ (0xFC7 * 8 + 2)
#define                                 nW_bit              _BIT_ACCESS(SSPSTAT,2)
// SSPSTAT<nWRITE>
extern volatile __bit                   nWRITE              __at(0x7E3A);	// @ (0xFC7 * 8 + 2)
#define                                 nWRITE_bit          _BIT_ACCESS(SSPSTAT,2)

#endif // _PIC18LF26K80_H_
